{"name": "Aatrox", "rationale": "Aatrox is a Diver-style fighter: a melee brawler who closes with enemies to contest space and force fights. His kit centers on timed empowered strikes and chained multi-sweep attacks that reward directional aim and hit-zone control, paired with a binding tool that punishes movement and creates forced repositioning. Mobility is flexible—an instant dash that can be used while casting—while his durability arises from heavy self-healing tied to damage and a transformative activation that greatly boosts movement, damage and sustain and that is extended by champion takedowns. Strategically he offers front-to-back disruption and sustained skirmishing: excelling in isolated duels, extended brawls, objective fights and split-push pressure."}
{"name": "Ahri", "rationale": "Ahri is a mobile skirmisher mage who embodies the Skirmisher archetype through short, repeatable bursts of movement and single-target pick rather than sustained frontline presence. Mechanically she layers targeted crowd control and precision-based projectile pressure with rapid repositioning, converting movement and skill-sequence execution into high-burst windows while rewarding clean takedowns with on-hit self-sustain; her toolkit mixes auto-seeking and returning projectiles that change trade dynamics and enable both poke and follow-up burst. Strategically, Ahri brings consistent single-target pickup and roving pressure, strong outplay and escape potential, flexible wave management, and a skirmish-focused toolkit that favors roaming, picks, and assassination over prolonged teamfight frontline roles."}
{"name": "Akali", "rationale": "Akali is an Assassin: a mobile, single-target burst champion whose design privileges assassination and skirmish play over sustained frontline duty. Her identity is combo-driven and position-focused, built around concealment and mark/reactivation mobility—she creates tactical zones that reward exiting for empowered follow-up strikes, hides in a smoke that enables resets and ambiguous approach paths, and uses markable projectiles plus a recastable dash to chain targeted gap-closes; her ultimate is a direct, re‑castable strike tool for committing to or finishing targets. Strategically, she supplies reliable pick threat, flank and roam pressure, and high outplay potential in short trades, excelling at isolating priority foes while depending on stealth and mobility to avoid prolonged engagements."}
{"name": "Akshan", "rationale": "Akshan reads as a Skirmisher because he blends sustained ranged damage with high-mobility, duelist tools that prioritize single-target kills and outplay potential. Mechanically he revolves around on-hit stacking and follow‑up strikes that convert sustained fire into burst windows and short defensive survivability, while his toolkit rewards precise skillshot hits and terrain-enabled movement to repeatedly enter and exit fights; a long‑range returning attack exposes foes and a targeted power‑charge provides a high-risk, high-reward execution option. Strategically he supplies potent pick and skirmish pressure, flank and chase mobility, and an uncommon macro lever: incentivized takedowns that restore ally fighting capacity and deny enemy advantages, enabling comeback plays and decisive isolated trades."}
{"name": "Alistar", "rationale": "Alistar functions as a Warden— a frontline, disruption-first protector who forces fights on his terms by displacing and incapacitating enemies to shield allies. Mechanically he is a CC-driven engager and sustain conduit: his kit revolves around chaining hard crowd control and purposeful repositioning, building internal stacks from successful disruptions and nearby takedowns to convert aggression into area healing and persistent close-range pressure, while a self-cleanse and large damage mitigation window let him ignore enemy lockdown and remain a durable anchor. Strategically, Alistar provides reliable hard-engage and peel, strong objective initiation and contesting, consistent teamfight disruption, and a space-creating frontline that enables skirmishes and secures fragile teammates."}
{"name": "Ambessa", "rationale": "Ambessa reads as a Diver: a mobile, melee engager who forces close-quarters confrontations and locks down priority targets. Mechanically she centers on building Medarda Maxim through ability windows that empower her basic attacks—extending reach, impact, and energy sustain—while a convertible defensive tool can be immediately turned into a gap-close, creating deliberate initiation windows. Her kit rewards directional sequencing and positional timing, chaining slashes, area ground strikes and spins to control space, apply slows, and amplify follow-up hits. Strategically she supplies reliable single-target lockdown and execution potential, flexible flank initiation, sustained dueling pressure, and disruptive area control that reshapes enemy movement and punishes mistimed retreats."}
{"name": "Amumu", "rationale": "Warden — a short‑range, durable initiator whose identity centers on area lockdown and sustained disruption. Mechanically he couples a single‑target engage tool that forces him into the fight with persistent, proximity‑based damage and a mark mechanic that amplifies allied magic follow‑up; he is rewarded for absorbing basic attacks through self‑mitigation and cooldown recovery, enabling repeated frontline presence. Strategically he provides reliable multi‑target crowd control and zoning for teamfights, hard engage and pick potential, and a layered threat that converts enemy max‑health stacking and allied magic damage into high payoff during extended skirmishes and objective fights."}
{"name": "Anivia", "rationale": "Anivia is an Artillery Mage: a long‑range, control‑centric caster who shapes space and tempo rather than trading sustained mobility or dueling power. Mechanically she functions as a zoning engine that layers persistent area damage and movement impairment with a single impactful setup combo that amplifies follow‑up damage; her tools create hard terrain and a threatened area that forces enemy pathing and commitment, while a unique revival mechanic turns death into a brief defensive objective opponents must finish. Strategically she provides deterministic area denial and siege pressure, reliable poke and wave management, pick and choke‑point control in fights, and a safe, immobile source of teamfight control that converts successful setups into decisive sustained damage."}
{"name": "Annie", "rationale": "As an Artillery Mage she delivers concentrated, short-window burst and area denial through a kit built around a stacking passive that converts ability usage into a guaranteed crowd-control trigger. Mechanically she revolves around timing that charge to enable a single spell or combo to decisively lock a target, pairing a kill-reset single-target nuke with reliable AoE damage for waveclear and teamfights, a defensive shield that grants mobility and punishes attackers, and a summoned ally that provides persistent zone control and on‑hit burn. Strategically she supplies reliable pick-and-burst threat, compact area denial and objective pressure, predictable engage windows for teammates, and strong single-spell payoff for coordinated follow-up."}
{"name": "Aphelios", "rationale": "Aphelios is a Marksman defined by a dual-weapon resource system that forces deliberate sequencing and micro-decisions. His kit revolves around alternating armaments with distinct on‑hit identities and consumable actives that expend discrete charges; when a weapon’s ammo is depleted another is auto-equipped, creating a predictable but deep rotation to manage. This yields a mechanical identity centered on weapon-state management and timing rather than simple sustained attack trading — players must align current weapons with range, tempo and target priority. Strategically he delivers a broad palette of damage profiles (long-range precision, close-range sustain, area damage) plus zoning and utility, acting as an adaptable primary DPS and wave-control tool that rewards planning, positioning, and resource awareness."}
{"name": "Ashe", "rationale": "Ashe is a Marksman: a long‑range sustained damage dealer who exerts control from the outskirts of fights by amplifying and relying on her basic attacks while shaping enemy movement. Mechanically she revolves around attack augmentation and a chargeable DPS window—her kit augments autos with persistent slowing effects, builds a focus resource through attacks to unlock a rapid‑fire state, and pairs straightforward cone poke with global scouting and a distance‑scaling crowd control ultimate. Strategically she supplies reliable sustained damage, pervasive zone control and peel via slows, long‑range pick and initiation potential, and macro value through vision and pressure that aids sieges, rotations, and kiting-heavy team compositions."}
{"name": "Aurelion Sol", "rationale": "Aurelion Sol fits the Artillery Mage archetype: a long-range, zone-oriented caster who exerts influence from distance rather than frontline skirmishing. Mechanically he is built around a permanent scaling passive that incrementally amplifies his toolkit and an aerial state that both grants mobility and converts his primary beam into an uninterrupted, higher-powered sustained damage channel while allowing spellcasts in transit. His kit layers persistent area denial with concentrated gravitational fields and high-impact area CC, combining soft zoning (continuous damage and space control) with occasional hard interruption. Strategically he provides exceptional siege and objective control, layered teamfight crowd-control and disruption, and the ability to pressure side lanes or force rotations through aerial repositioning and long-range threat projection."}
{"name": "Aurora", "rationale": "Aurora functions as an Artillery Mage: a ranged spellcaster who shapes fights from a distance with layered projectiles, area denial, and single-target finishing power. Mechanically she revolves around a stacking execution mechanic that converts sustained hits into percent-based punishment and spawns spectral followers that amplify her self-sustain, while her kit features conditional recasts and returning projectiles that reward timed skill use and target marking. Mobility is woven into her spellset—short stealth/translocation windows, a protective leap, and positional propulsion let her dodge threats and re-enter skirmishes. Strategically she offers poke and pick potential, zone control through slows and a rift, private sustain into extended trades, and reliable repositioning to threaten isolated targets or escape danger."}
{"name": "Azir", "rationale": "Azir is an Artillery Mage who projects sustained, long-range pressure through summoned constructs rather than direct spell bursts, fitting the siege-and-zone control profile. Mechanically he is a summoned-unit controller: his primary damage and reach come from autonomous soldiers and temporary turret-like discs whose potency depends on his proximity, turning placement and presence into both offense and defense. He converts placement into mobility and survivability by tethering himself to those constructs to reposition and guard himself, and his signature formation creates a moving line that displaces enemies to reshape engagements. Strategically he provides layered area denial, sustained poke, objective and tower pressure, pick-orientated zoning and reliable peel by forcing enemy movement and controlling space from range."}
{"name": "Bard", "rationale": "Bard is a Playmaker/Utility Support whose core archetype is roaming tempo control—he rewards map movement with persistent resources that augment basic attacks and enable extended presence across the map. Mechanically he functions as a resource‑accumulator and toolkit crafter: wandering to collect map chimes that empower harassment, placing ephemeral heal zones, firing a chainable projectile that can create immobilizing setup when it interacts with terrain or targets, carving one‑way terrain portals for allied repositioning, and delivering a point‑target global stasis. Strategically he supplies pick potential, macro rotation speed, creative engages and disengages, objective tempo control, and high-value saves or interruptions—trading direct sustain for versatile, game‑wide utility and playmaking."}
{"name": "Bel'Veth", "rationale": "Bel'Veth is a Skirmisher: a mobile, melee duelist built to chase, reset and out-sustain single targets in extended fights. Mechanically she orients around an attack-cadence engine and temporary combat stacks that are consumed by hits, directional mobility with independent reset windows, and a hit-reset loop that rewards landing champion strikes to maintain aggressive positioning. Her kit trades raw single-hit power for extreme strike frequency, layered sustain through a defensive posture that converts cadence into life, and an escalating true-damage ramp that punishes focused consecutive strikes. Strategically she provides relentless one-on-one threat, objective and monster pressure via takedown resources, flank and chase potential, and a late-fight presence that forces disciplined target control and positional responses from opponents."}
{"name": "Blitzcrank", "rationale": "Blitzcrank is a Warden — a front-line disruption tank defined by single-target displacement and high-impact initiation. Mechanically he revolves around a catch-and-chain pattern: a long-range, commitment-oriented reposition that forces enemies out of place, short burst mobility that enables aggressive approaches but leaves a brief recovery window, an empowered melee strike that amplifies follow-up lockdown, a resource-tied emergency shield for survivability, and a charged area discharge that strips defenses and silences nearby foes. Together these elements create a pick-heavy, binary playstyle that trades bursty commitment for game-altering control. Strategically he offers reliable pick potential, zone denial and peel, objective control through forced positioning, and a durable front line that shapes enemy movement to enable allied follow-up."}
{"name": "Brand", "rationale": "Brand is an Artillery Mage: a long-range, area-damage spellcaster who shapes fights through poke, zone control, and explosive collateral damage. Mechanically he centers on applying a persistent burn mark that empowers follow-up spells and eventually detonates to spread damage, which makes his play revolve around deliberate sequencing and accurate skillshots to chain enhanced effects across multiple enemies; finishing blows refund resources, reinforcing spell-focused waveclear and sustained trading. Strategically he provides heavy magic AoE and siege presence, punishes clustered or mispositioned targets with chained explosions, and offers reliable secondary crowd control via his burn-enhanced stuns and slows, serving as a primary poke/zone tool and burst-oriented teamfight centerpiece."}
{"name": "Braum", "rationale": "Braum is a Warden whose design centers on durable protection, zone control, and team-enabled crowd control. Mechanically he plays as a positional guardian who trades his own mobility and defenses to create safety windows for allies: his kit emphasizes coordinated CC through a team-contributable stacking stun, directional interception of enemy projectiles that converts incoming pressure into protected space, short dives toward allies that boost his survivability, and a linear disruption that displaces and impedes foes. Strategically he serves as a peel-and-engage anchor who denies approaches, soaks damage, creates tempo for allied follow-up, secures objectives through area denial, and amplifies teamfight success via reliable protection and setup."}
{"name": "Briar", "rationale": "Briar is a Skirmisher: a melee duelist built to close, stick, and out-sustain single targets in extended fights rather than trade from range. Mechanically she revolves around stackable bleed that deals ongoing damage while converting enemies' missing health into self-healing, empowered attacks that extend reach and scale off targets' missing health, and layered mobility/engage tools that create windows to commit and chain follow-ups. A chargeable sustain state grants damage reduction and multiple recasts for prolonged trades, and her ultimate locks on and reveals a priority target before surging in to deliver disruptive AoE fear. Strategically, she supplies reliable single-target lockdown and pick pressure, durable skirmishing and objective threat via execute-style damage and built-in recovery, plus localized teamfight disruption and peel through immobilize and fear."}
{"name": "Caitlyn", "rationale": "Caitlyn is a Marksman built around extreme range and precision—an artillery-style ADC who wins fights by dictating where and when engagements happen. Mechanically she revolves around building and expending empowered auto-attacks augmented by deliberate setup tools: long-range charged poke with linear penetration, concealed snares that reveal and immobilize to guarantee follow-up damage, and a recoil reposition that enforces spacing and kiting. Strategically she excels at zone control, punishment of overextension, and creating long-range pick windows; she delivers safe sustained single-target pressure, reliable siege and lane poke, and the ability to convert positional advantages into high-value takedowns while maintaining distancing from threats."}
{"name": "Camille", "rationale": "Camille functions as a Diver–a mobile melee fighter designed to single out high-value targets and win extended face-to-face trades. Her mechanical identity revolves around empowered melee strikes with a recast and damage-amplification window, a conditional defensive layer that adapts to opponent damage types, short invulnerability windows for committed cone attacks that heal on successful multi-hit trades, and terrain-tethered mobility that converts walls into long-range initiation and repositioning tools. Strategically she brings guaranteed single-target lockdown and reliable flank engages, sustained one-on-one dueling and skirmish presence, and strong pick/zone control that forces isolated fights while enabling split-pressure through self-sufficient survivability and high-value target denial."}
{"name": "Cassiopeia", "rationale": "Artillery Mage — Cassiopeia functions as a zone-centric, sustained-damage mage who controls space and punishes positioning. Mechanically she revolves around applying and maintaining poison to amplify a rapid, low-cooldown single-target strike that restores resources and sustains her, while her toolkit layers lingering area denial and a directional crowd-control burst that severely penalizes enemies who face her. Her movement profile is unusual: she gains intrinsic mobility as she progresses rather than relying on conventional mobility items, reinforcing a playstyle that anchors fights rather than skirmishes away. Strategically she brings persistent DPS, territorial denial, execution and pick potential, shaping teamfights by locking enemies into damaging ground and creating windows for teammates to follow up or disengage."}
{"name": "Cho'Gath", "rationale": "Cho'Gath reads as a Warden — a durable frontline who controls space with disruptive, hard crowd control while simultaneously posing a persistent single-target execute threat. Mechanically he is a scaling melee brawler built around permanent growth via consume stacks and sustained tankiness from unit kills, combining innate sustain with layered disruption (airborne displacement, silence, slows) and on‑hit spikes that punish high-health targets. Strategically he provides reliable frontline anchoring, peel and area denial, objective-secure pressure and lane bullying; he excels in extended fights and skirmishes where his permanent scaling and zoning convert durability into decisive battlefield control."}
{"name": "Corki", "rationale": "Corki is a Marksman defined by mid-range poke and mixed-type sustained damage: he functions as a ranged DPS who blends ability burst, area explosions, and consistent basic-attack augmentation. Mechanically he combines on‑hit true damage on autos with alternating modes of output—longer-range explosive poke and a short, mobile sustained-damage posture that controls space—rewarding rhythmically weaving attacks and abilities to maximize mixed magical/physical pressure and area denial. Strategically he offers reliable teamfight DPS and siege poke, dependable waveclear and objective pressure, and flexible skirmishing: he can harass from safe distances, reveal and punish targets, contest clustered fights with AoE explosions, and reposition to kite or apply split pressure."}
{"name": "Darius", "rationale": "Darius is a Diver: a front-line melee brawler built to lock onto high-value targets, force short-range engagements, and punish clustered or isolated enemies. Mechanically he revolves around applying and ramping a persistent bleed through attacks and abilities, then converting those stacks into powerful execution windows; his kit rewards sustained close-range contact, precise positioning for maximum-weapon-edge hits, and aggressive timing to secure kills that grant ability refreshes. Strategically he supplies reliable single-target execution, durable frontline threat, and local area control—pulling and slowing foes to deny escape, sustaining through edge-based healing, and creating reset-driven carry potential that punishes mispositioning and enables decisive skirmish follow-through."}
{"name": "Diana", "rationale": "Diana fits the Diver archetype—she's designed to commit to and survive close-quarters engagements, leaping into priority targets to disrupt backlines and trade in melee. Mechanically she is a spell-driven melee caster that synchronizes empowered basic attacks with a mark-and-prime system, pairs a self-buffing shield with orbiting detonations that reward timing, and uses a conditional gap-closer whose cooldown collapses against marked foes alongside a gravitational pull ultimate that scales with how many champions are caught. The kit emphasizes chaining casts and on-hit cleaves to extend fights and reopen engages. Strategically she provides reliable single-target dive and short-range AoE initiation, pick potential via reveal/marking, and compact teamfight disruption that punishes grouping and enables decisive follow-up."}
{"name": "Mundo", "rationale": "Juggernaut — a durable frontline who specializes in prolonging fights through self-renewal and damage resilience, fitting the juggernaut role by forcing enemies to expend focused burst to stop him. Mechanically he is built around sustained self-healing tied to his maximum health, a periodic anti-immobilize that trades current health for a persistent, contestable resource, on-hit and area tools that refund health when they connect, a channel that stores incoming damage to be discharged, and an auto-empowered strike that scales with max health and missing health to amplify finishing pressure. Strategically he provides reliable frontline soaking, long-fight dueling and split pressure, objective-contesting presence via his consumable interactables, and a playstyle that punishes drawn-out engagements and encourages opponents to coordinate high-burst removal or contested skirmishes."}
{"name": "Draven", "rationale": "Draven is a Marksman defined by extreme single-target offensive throughput and a high-risk, high-reward snowball identity: he is a lane bully who converts mechanical mastery directly into economic and kill pressure. Mechanically his kit centers on juggling empowered, ricocheting axes that amplify basic attacks and interact with a personal attack-speed/mobility window—catching axes is both a mechanical requirement and a resource loop that refreshes momentum—while a separate accumulated bounty mechanic is consumed on champion takedowns to accelerate his power spike. Strategically he brings relentless lane dominance, focused execute and sustained DPS that threaten carries and structures, plus moderate utility in the form of a directional displacement/slow and a long-range finishing tool, making him a primary front-to-back damage engine whose value depends on positioning, tempo control, and consistent mechanical execution."}
{"name": "Ekko", "rationale": "Ekko reads as an Assassin because his kit prioritizes rapid single-target burst, high mobility, and timing-based outplay over sustained teamfight frontlining. Mechanically he functions as a mobile skirmisher who layers a stacking on-hit tempo effect with a returning skillshot for zoning and poke, a delayed area zone that punishes poor positioning while granting him defensive buffer, a gap-closing empowered attack that repositions him instantly, and an ultimate that rewinds his position and health to convert damage taken into a clutch survival and counterplay tool. Strategically he supplies reliable flank and pick pressure, burst threat in isolated fights, dynamic in-and-out skirmishing, and a built‑in reversal mechanic that enables high-risk dives and game-changing outplays."}
{"name": "Elise", "rationale": "Elise fits the Diver archetype because her kit is designed to close distance, lock down a priority target, and convert an engagement into a quick, committed melee kill; she excels at initiating and sticking through mobility and a single-target crowd control tool. Mechanically she is a dual-form engager that toggles between a safer, ranged harassment and summon-focused mode and an aggressive melee apex that amplifies basic-attack potency and attack tempo; she layers persistent auxiliary units, a leap/retarget aerial reposition, and a single-target immobilize to create windows for committed dives. Strategically she supplies reliable pick potential and dive initiation, layered zone control via summoned spiders, heightened early-to-mid skirmish pressure and objective-threat through strong single-target execution and repositioning flexibility."}
{"name": "Evelynn", "rationale": "Evelynn is an Assassin—an ambush-oriented skirmisher that specializes in stalking and quickly eliminating single high-value targets from stealth. Mechanically she orbits a camouflage state that enables approach and disengage, a curse/expunge interaction that creates timed kill windows, repeatable projectile damage for sustained spike potential, and a mobility-heavy on-hit dash that synergizes with re-entering shadow to refresh offensive options; her finisher grants brief untargetability and a relocating execute that doubles as an escape. Strategically she supplies reliable pick pressure, flank control and roaming threat, converting map invisibility into space denial and single-target removal at the cost of sustained front-line presence."}
{"name": "Ezreal", "rationale": "Ezreal reads as an Artillery Mage: a long-range, skillshot-reliant damage dealer who shapes fights from distance rather than through hard crowd control. Mechanically he is built around precision and tempo—he accumulates a stacking self-buff that increases sustained attack rate, rewards hitting skillshots by reducing ability downtime, and uses a mark-and-detonate interaction to recover resource and maintain output; a short self-teleport that simultaneously fires a projectile ties repositioning directly to offense. Strategically he supplies safe, consistent poke, mobile single-target pressure and strong kiting—scaling into a sustained DPS role that can influence fights and map pressure across long ranges while demanding high mechanical execution."}
{"name": "Fiddlesticks", "rationale": "Fiddlesticks reads as an Artillery Mage because his core role is delivering devastating area control from surprise positions rather than sustained frontline trading. Mechanically he functions as an ambush-driven zone controller: he plants deceptive effigies to mimic presence and deny information, sets up committed, high-impact engages through a blinked AoE channel, and couples fear-and-amplified-burst with sustained drains and layered crowd-control (slow, silence) to both punish clustered targets and self-sustain during chaos. Strategically he provides reliable initiation and disruptive teamfight zoning, pick threat from fog and flank angles, vision pressure through mimicry and brief sweeps, and forces opponents to respect threats of sudden, area-denying ultimates that restructure fights around his positioning."}
{"name": "Fiora", "rationale": "Fiora is a Duelist: a high-skill single-target duelist who excels in isolated fights and outplays through precise timing. Her mechanical identity revolves around identifying and striking specific Vitals to convert precision into decisive rewards—true-damage finishing power, sustain, and sudden mobility—while weaving empowered auto-attacks and short dashes that trigger on-hit effects and refresh opportunities to re-engage. A reactive parry turns enemy crowd control and burst against them, creating high-reward windows for follow-up punishment. Strategically she provides reliable single-target execution, split-push and skirmish threat, localized sustain for allies after successful takedowns, and a playstyle that prioritizes timing, target focus, and duel dominance."}
{"name": "Fizz", "rationale": "Fizz reads as a Diver with strong Assassin leanings: his kit is built to close on and eliminate priority targets by diving into the enemy back line. Mechanically he combines permanent ghost-like mobility and an untargetable vault with a gap-closer that procs on-hit effects and a persistent on-hit bleed and empowered strike, creating a play pattern of short, committed entry bursts followed by sustained bleed pressure if he sticks. His toolkit rewards timed invulnerability and repositioning to dodge retaliation and reset fights, and his long-range summon delivers area displacement for setup or peel. Strategically he offers reliable single-target assassination and pick threat, high skirmish and roam pressure, and disruptive flank/diving presence that forces opponents to respect space and engage windows."}
{"name": "Galio", "rationale": "Warden — a large, tanky protector whose design prioritizes area control and allied safeguard: he functions as a frontline anchor that both soaks and dishes out disruptive magic damage. Mechanically he blends a cyclical empowered melee identity that rewards sustained, in-close engagements (with on-hit empowerment that scales off defensive stats and speeds up with champion or epic takedowns), a self‑regenerating magic‑absorb shield that can be held to reduce damage and force enemy attention, and multiple crowd‑control tools that displace, taunt or lift foes; a long‑reach protective intervention lets him relocate and deliver a delayed, high‑impact arrival. Strategically he provides reliable initiation and peel, sustained multi‑target disruption and zoning in clustered fights, global protective intervention for allies, and objective contest presence driven by his ability to both absorb spells and convert tankiness into offensive area threat."}
{"name": "Gangplank", "rationale": "Gangplank reads as a Skirmisher: a duelist-forward fighter who combines sustained basic-attack identity with long-range area control. Mechanically he orients around on‑attack throughput and environmental setup—he leverages an auto-attack augment and interactable explosives to convert single-target poke into burst and mobility resets, while earning persistent resources from takedowns that permanently enhance his toolkit. He also holds a dedicated self-sustain and cleanse allowing him to recover and re-enter fights. Strategically he supplies zone denial and tempo control: layered threat through placed explosives and a global-area bombardment that shapes engagements, creates pick and disengage windows, pressures objectives and split-push lanes, and rewards precision positioning and timing over raw stat spikes."}
{"name": "Garen", "rationale": "Garen is a classic Juggernaut: a straightforward melee brawler who trades mobility and ranged utility for raw durability and a single-target finishing threat. Mechanically he functions by sustaining out of combat, committing to short, decisive engages with a built-in mobility/cleanse, leveraging temporary damage mitigation and a persistent area-damage spin to dominate close-range exchanges, while a guaranteed execute on low-health foes secures kills; defensive stats grow through takedowns, reinforcing extended fights. Strategically he provides a reliable frontline anchor and duel threat that forces opponents to avoid isolation, offers consistent zone and cleanup pressure, and delivers simple, high-impact execution and damage-soaking for his team."}
{"name": "Gnar", "rationale": "Gnar functions as a Skirmisher who toggles between a nimble ranged harasser and a short-lived, hard-engage melee threat, fitting the class by blending hit‑and‑run trade patterns with momentary frontline disruption. Mechanically he is driven by a resource-based transformation that swaps stats and an entire toolkit, creating two distinct playmodes that reward managing Rage generation, timing form windows, and exploiting form-specific movement and interaction tools rather than relying on single-skill bursts. Strategically he offers safe poke, kiting and split-pressure in his small form and a predictable, terrain-amplified initiation and area crowd-control window in his large form, forcing teams to play around his cyclical power spikes and zoning potential."}
{"name": "Gragas", "rationale": "Gragas reads as a Diver: a mobile frontline initiator who commits into fights to create disruption and reposition enemies while sustaining through self-healing and damage mitigation. Mechanically he is a combo-driven brawler that blends a controllable delayed zone with a collision-based dash and a long-range displacement, rewarding timing and chaining—use mobility to engage or disengage, detonate zones to zone and burst clustered foes, and follow up with displacement to isolate or scatter targets; his damage profile includes area on-hit effects that scale with enemy bulk, reinforcing threat to tanks. Strategically he provides dependable initiation and peel, flexible engage/disengage tools, durable sustained presence in fights, strong area control and anti-clump/anti-tank pressure for coordinated teamplay."}
{"name": "Graves", "rationale": "Graves functions as a Skirmisher: a short-to-mid range, self-sufficient duelist who trades in bursts rather than sustained, long-range poke. Mechanically he is built around limited-ammunition burst windows and reloads that are tightly integrated with mobility, plus multi-projectile, cone-based shots and delayed area explosions that reward careful spacing and multi-hit placement. His toolkit creates both personal survivability via dash-tied defensive stacks and offense by restoring mobility on successful hits, while an obscuring smoke field grants vision control and movement impediment to shape fights. Strategically he brings high single-target and clustered-burst damage, zone denial for objective fights and picks, reliable self-peel/repositioning, and strong skirmish presence in tight corridors and side-lane duels."}
{"name": "Gwen", "rationale": "Gwen is a Skirmisher that excels in short-to-medium ranged duels by trading repeatedly and forcing isolated fights rather than initiating teamwide engagements. Her kit is built around empowered basic attacks that scale against enemy durability and sustain herself, layered multi‑hit and reactivatable abilities that convert portions of her damage to unavoidable damage, a mobility tool that repositions and temporarily amplifies her attack cadence and reach, and a personal protective zone that denies enemy targeting for windows. Mechanically she rewards precise sequencing—weaving empowered autos between ability activations, managing reactivations, and timing her protective window—so she functions as a self-contained duelist who shreds single targets, creates split-pressure and pick potential, provides local zoning and chase control, and converts short windows of safety into extended, high-damage skirmishes rather than offering hard engage or broad utility for the team."}
{"name": "Hecarim", "rationale": "Diver — Hecarim embodies a mobility-first frontline engager who commits into enemy formations to create chaos and isolate targets. Mechanically he converts movement speed into offensive power, rewards sustained close-quarters fighting through a stacking cleave that refreshes and amplifies his presence in trades, and combines area persistent damage with defensive self-healing while locked into melee. His kit trades momentary vulnerability for high-impact entries: ghosting and built-up speed let him stretch gaps and extend his basic attack into a displacing strike, while a long-range charge provides a fear-and-slow follow-through that scales with approach. Strategically he offers reliable, high-mobility initiation and disruption, durable sustained damage and self-sustain in the thick of combat, and strong map-joining and flank potential—functioning as a melee engage engine that both starts fights and punishes teams that cluster or misposition."}
{"name": "Heimerdinger", "rationale": "Heimerdinger functions as an Artillery Mage built around persistent, deployable damage sources rather than direct melee or mobile trading, matching an artillery/specialist archetype that controls space from range. Mechanically he centers on placing and upgrading automated defenses and area effects, using those deployables as the primary damage engines while his own actions enhance or interact with them; the kit rewards deliberate turret placement, timed ability augmentations, and positional play and even grants movement interactions tied to friendly structures. Strategically he offers sustained poke and waveclear, choke-point and objective denial, safe siege and split-push pressure, and creates engineered zones that force opponents to respect controlled space and tempo."}
{"name": "Hwei", "rationale": "Hwei is an Artillery Mage because his identity centers on long-range, pattern-based spells and area-denial rather than sustained melee trading. Mechanically he operates through three discrete mood states that swap his entire toolkit, with an instant mood-change signature that enables seamless, on-the-fly combinations; this creates a playstyle built on layered zoning, delayed explosions, targeted amplified strikes against isolated foes, and a mix of seeking projectiles and persistent ground effects. Strategically he supplies extended poke and siege pressure, space control and layered crowd control for objective fights, conditional single-target burst on separated enemies, and situational team utility—offensive threat, defensive shielding and movement utility—allowing him to flex between poke, peel, and pick depending on mood sequencing."}
{"name": "Illaoi", "rationale": "Illaoi reads as a Juggernaut: a durable, territory‑centric fighter who forces enemies to fight inside her controlled space rather than chase or kite her. Mechanically she orients around persistent, terrain‑tethered tentacles that autonomously apply pressure and grant sustain when they strike, plus a spirit‑extraction mechanic that converts champions into high‑value, vulnerable targets and spawns additional tentacles to enforce committed duels; short repositioning strikes and an empowerment phase let her briefly close gaps and amplify those tentacle hits. Strategically she delivers unskippable localized zone control and objective denial, punishes overextensions with inevitable damage and sustain, and functions as a decisive single‑target duelist and frontline anchor that forces opponents into costly, committed engagements."}
{"name": "Irelia", "rationale": "Skirmisher — Irelia is a mobile melee duelist built to seek, stick to, and finish priority targets through repeated short trades and chained mobility. Her kit revolves around stacking sustained offense that transforms into empowered auto-attacks, a gap-closing reset that applies on-hit effects and self-sustain, and tools that both mitigate incoming damage and create hard crowd-control windows. Mechanically she functions by weaving passively amplified basic attacks with opportunistic resets and precision-timed defensive charges, while using converging projectiles and a perimeter-forming ultimate to sculpt the battlefield. Strategically she provides high single-target threat and execution potential, reliable flank and split-pressure, and localized zone control that forces fights on her terms."}
{"name": "Ivern", "rationale": "Enchanter — Ivern embodies a supportive, utility-first jungle archetype: he trades traditional monster-slaying for a camp-maturation and gifting mechanic that reshapes jungle tempo. Mechanically he is a zone and topology controller who leverages deployable brush, a targeted immobilize with built-in repositioning, a protective shield that converts into AoE slow/damage, and a controllable summoned frontline to contest space. These systems synergize around enabling allies rather than maximizing personal damage—he creates vision and ambush terrain, sets up reliable picks and disengages, provides clutch peel and shields in skirmishes, and exerts sustained map pressure through objective tempo and persistent presence rather than direct DPS."}
{"name": "Janna", "rationale": "Janna is an Enchanter support because her core purpose is to empower and protect allies rather than duel opponents. Her mechanical identity centers on mobility- and timing-driven utility: she amplifies allied movement to enable repositioning, uses a chargeable displacement to shape space, provides a targeted, decaying protective barrier that also grants offensive amplification, and sustains teams with a channeled area heal while repelling threats. Her toolkit scales with movement-focused play and rewards precise timing of channel and charge windows to interrupt engages or enable skirmishes. Strategically she delivers reliable peel and disengage, turret and objective protection, allied mobility/enabler power for roams and kites, and teamfight zoning that reshapes enemy approach vectors."}
{"name": "Jarvan IV", "rationale": "Jarvan IV functions as a Diver: a committed initiator who closes onto priority targets to start fights and force decisive engagements by isolating foes with temporary terrain. Mechanically he is combo-driven around positional anchors and territorial control—he uses a deployed flag as a tether and attack-speed amplifier, a directional engage that locks into that tether to displace and interrupt, and an impact that creates a short-lived circular barrier to trap or separate enemies; he also carries an on-hit damage trait that scales off current health and a short defensive tool that slows foes and grants a shield. Strategically he is a primary engage and pick tool that shapes fights through zone denial and target isolation, enables short brawls by buffing allied attack cadence, and offers frontline presence with brief protective utility to secure objectives and force favorable team-fight setups."}
{"name": "Jax", "rationale": "Skirmisher: Jax is a melee duelist built to win extended one‑on‑one and small‑group fights through sustained ramping damage and targeted mobility. Mechanically he revolves around a stacking attack‑speed ramp that rewards prolonged engagement, a reliable single‑target gap closer/commit tool and an empower that converts autos into spike damage, combined with a defensive/evasive window that negates basic attacks and converts defense into area disruption. His ultimate consumes built‑up momentum to deliver bonus magic burst and a defensive AoE, making his damage profile shift from steady sustained output to concentrated payoff. Strategically he offers isolated kill pressure and split‑push threat, dependable flank and dive capability, and teamfight utility through self‑peel, area disruption, and a late‑fight damage spike when allowed extended uptime."}
{"name": "Jayce", "rationale": "Jayce reads as a Skirmisher because his kit is built around short, decisive confrontations that toggle between ranged harassment and melee clutching; he excels at picking favorable fights rather than prolonged frontline duties. Mechanically he is defined by stance-swapping that changes attack patterns and damage types, with a built-in mobility/reset on transformation that enables rapid repositioning, poke that weakens enemy defenses, localized zone pressure, and targeted crowd control that forces repositioning. Strategically he supplies range control and tempo: a lane bully and duel threat who shapes engagements through poke-to-all-in sequencing, creates pick and split-pressure opportunities, and provides movement and vision utility to help allies contest space without serving as a sustained tank or primary engage tool."}
{"name": "Jhin", "rationale": "Jhin is an Artillery Marksman who functions as a precision-focused sniper rather than a sustained auto-attacker, trading attack speed for few extremely potent shots. His mechanical identity is built around a rhythm: deliberate, high-impact bullets with a guaranteed amplified finisher, tempo-dependent mobility tied to precision hits, and a toolkit that layers long-range poke, planted trap zones and a multi-shot finishing volley to control space. Strategically he supplies long-range pick and siege pressure, zone denial and setup for allied follow-up, reliable single-target execution from safety, and tempo control through timed burst windows that force opponents to respect his firing arcs and trapfields."}
{"name": "Jinx", "rationale": "Marksman with artillery instincts: Jinx functions as a ranged damage carry who trades mobility for overwhelming sustained and burst physical output from two distinct firing modes and a long-range execute. Mechanically she is built around weapon-swapping and momentum—one mode rewards rapid firing and stacking for extended DPS while the other trades resources for area-piercing reach—combined with a reset-on-takedown mechanic that grants sudden mobility and attack-rate amplification. Strategically she provides reliable siege and cleanup power, long-range poke and execute threat that punishes low-health targets, zone control through deployed traps and slows, and the ability to convert kills or structural picks into extended map pressure and rapid teamfight follow-ups."}
{"name": "K'Sante", "rationale": "K'Sante reads as a hybrid Warden/Skirmisher: a durable frontline who also excels in short-range duels. Mechanically he layers temporary marks and stacked strikes into empowered consumption hits, trades in a preparatory defensive stance that grants situational damage reduction and a recast window, and leverages targeted mobility with a shield that can extend to allies and traverse terrain. His ultimate provides single-target lockdown, a positional reset and a transformation into a more aggressive close‑quarters breaker. Strategically he brings reliable peel and disruption, dependable single‑target lockdown for picks, hard engage windows and resilient brawling that anchors skirmishes and controls flanks."}
{"name": "Kai'Sa", "rationale": "Kai'Sa is a Marksman whose identity fuses hybrid burst and skirmishing through an adaptive, evolving kit. Mechanically she centers on applying and stacking a short-duration mark that amplifies follow-up damage while her core abilities scale and transform as she grows, enabling a shift from ranged poke to high single-target burst and sustained on-hit pressure. The kit prioritizes mid-range harassment that reveals space, a brief stealth window for repositioning, and a targeted, shielded dash for aggressive entries and safe extraction. Strategically she brings reliable pick and assassination potential, flexible damage profiles that punish isolated targets, strong small-team skirmish carry power, and opportunistic lane pressure and scouting utility."}
{"name": "Kalista", "rationale": "Kalista functions as a Marksman-skirmisher: a ranged, attack-driven duelist who excels at extended kiting and single-target takedowns. Mechanically she rewards precise attack timing and movement execution—her basic strikes are linked to short, attack-timed traversals and an uninterruptible windup that enables mid-windup retargeting—while her kit layers persistent spear stacks via attacks and a piercing projectile that can transfer stacks, which are then consumed for high single-target execute and a brief slow. She also brings a tether-based ally interaction that temporarily removes, cleanses, and repositions a teammate and an autonomous vision patrol. Strategically she supplies sustained kiting damage, reliable execute pressure for objectives and picks, strong repositioning playmaking and peel through ally control, and demands coordinated positioning and attack-weaving to maximize impact."}
{"name": "Karma", "rationale": "Karma is an Enchanter support: her identity is centered on adaptive utility rather than raw sustained damage, combining shields, movement modifiers, and single-target control to empower allies and shape fights. Mechanically she orbits a timed empower that alters her basic spells and a passive that rewards landing damaging abilities by accelerating access to that empower, which forces a play pattern of measured poke and well-timed empowered casts. She provides short-to-medium range area control and a tether-based lockdown that rewards sustained focus for a root and follow-up heal, while her empowered defensive cast spreads protection and mobility. Strategically Karma brings layered peel and poke, reliable zone control for objective fights, flexible engage/disengage leverage, and a toolkit that amplifies allies and creates single-target pick windows without committing to hard initiation."}
{"name": "Karthus", "rationale": "An Artillery Mage that functions as a persistent, high-impact caster, Karthus trades mobility for extended-area and map-spanning magic damage, operating as a stationary damage engine and late-fight finisher. His identity centers on sustaining an aura that pressures nearby foes at the cost of his own resources and remaining a lethal presence after death, enabling continued spellcasting and a global finishing strike. Mechanically he emphasizes zone control through delayed, often single-target-amplified blasts, resource-management tradeoffs, and a death-state that preserves offensive output. Strategically he delivers reliable waveclear and teamfight DPS, punishes low-health targets across the map, and forces opponents to respect persistent zoning and unavoidable long-range threat."}
{"name": "Kassadin", "rationale": "Kassadin is an Assassin who embodies a mobile burst-mage assassin: he excels at closing short gaps to delete priority targets and escape immediately, fitting the Assassin class through backline penetration and high single-target threat. Mechanically he centers on a blink-based loop that scales with repeated uses, combined with an empowered basic-attack resource interaction and built-in anti-magic defenses; his kit alternates between aggressive repositioning, brief survivability, and concentrated magic burst. Strategically he supplies pick-and-flank pressure, reliable roams and split threat, and a direct counter to magic-reliant enemies through innate mobility and damage mitigation, shaping team fights by forcing isolated engagements."}
{"name": "Katarina", "rationale": "Katarina is an Assassin: she specializes in rapid, close-range execution of high-value targets through extreme mobility and reset-driven play. Mechanically she orbits a dagger-placement and teleportation loop—positioning to retrieve or leap to dagger locations and enemy units enables chained engagements; kills or timely takedowns dramatically reduce her ability cooldowns, rewarding multi-target resets and aggressive re-entry. Strategically she brings reliable single-target burst and chaotic, reset-fueled teamfight skirmishing: she can dive into clustered fights to convert resets into multi-kills, punish mispositioning, threaten flanks, and manipulate wave and space control through area dagger interactions, forcing opponents to commit focused attention."}
{"name": "Kayle", "rationale": "Kayle functions as an Artillery Mage: a time- and level-driven ranged carry whose identity is built around a progressive transformation from fragile melee to a high-range, empowered auto-attacker. Mechanically she trades early safety for a deterministic growth path—her baseline evolves into extended reach, stacked onboard power and on-hit magical augmentation with area wave effects, supported by a targeted heal that grants mobility and a timed invulnerability that enables clutch plays. She emphasizes sustained single-target and area DPS, zoning via extended attack reach and slows, and utility through a temporary defensive window and enemy defensive reduction. Strategically she brings reliable late-game sustained damage and siege/split-push presence plus a local sustain-and-save tool that lets teams commit to high-value engages."}
{"name": "Kayn", "rationale": "Kayn is a Skirmisher: a mobile melee duelist built to enter fights from unconventional angles and contest single targets. Mechanically he centers on a momentum-driven transformation that permanently defines how he trades—pairing directional mobility, area sweeps and a vanish-and-reshadow finishing tool with terrain traversal that rewards creative pathing and on-contact sustain. His kit prioritizes stickiness and assassination windows over raw front-line durability, enabling repeated entry and exit during skirmishes. Strategically he provides flank pressure, reliable single-target elimination and objective contesting through map mobility, able to pivot between extended dueling or focused burst execution depending on his completed form."}
{"name": "Kennen", "rationale": "Kennen reads as an Artillery Mage: a spell-focused ranged skirmisher whose kit creates layered zone control and multi-target burst rather than prolonged single-target brawling. Mechanically he is built around applying transient marks through spells and empowered basic attacks and then detonating those marks to stun and refresh resources, so play revolves around weaving abilities and hits in precise sequences, using a short-duration lightning form for repositioning and touch-based sustenance, and leveraging a channeled area storm that pulses repeated lightning strikes. Strategically he supplies reliable multi-target disruption and zone denial for teamfights and objective control, functioning as a combo-driven engager/peeler who can poke, force flanks, and convert stacked burst into decisive crowd-control windows."}
{"name": "Kha'Zix", "rationale": "Kha'Zix reads as an Assassin — a predator designed to hunt and delete isolated foes rather than sustain prolonged frontline fights. Mechanically he revolves around isolation-amplified damage, stealth-enabled empowered openers, and high mobility for gap closing and repositioning; his toolkit rewards approaching from fog-of-war or invisibility to secure focused burst and then re-enter fights through a short invisibility window that permits a secondary engagement. Strategically he provides reliable single-target pick threat and skirmish dominance, reshaping fights by punishing poor positioning and vision, exerting map pressure through split-target threat and rapid collapse rather than sustained area control or team-frontline durability."}
{"name": "Kindred", "rationale": "Kindred is a Marksman defined by a hunt-first identity: a dual-entity ranged damage dealer whose long-term power is earned by marking and eliminating targets. Mechanically they operate as a mobile, stacking skirmisher that accumulates permanent hunt charges from designated targets, trading short-term fights for growing global efficacy; their kit blends leap-and‑poke mobility, attack-speed and projectile-based trading, on‑attack healing windows, and a stacking execute that rewards focused follow‑up. Strategic value lies in objective and single‑target control—they pressure and snowball through targeted elimination, provide clutch area-level survivability and zoning for allies, and excel at sustained duels, kiting and split-threat play that converts hunt progress into lasting map leverage."}
{"name": "Kled", "rationale": "Kled reads as a Diver-skirmisher: a committed melee initiator who forces contact and won’t easily disengage once he commits. Mechanically he is defined by a mount/dismount resource that changes his mobility and survivability, an empowered basic-attack sequence that rewards sustained close-range trading, and mobility tools that mark, tether, drag and ultimately charge into fights—providing both single-target stickiness and disruptive displacement. Strategically he functions as a primary engage and pick engine that creates decisive skirmishes: he isolates and displaces priority targets, soaks and trades at the front line, and provides high-momentum map pressure via a long-range, team-enabled charge that accelerates allied follow-up and snowballing fights."}
{"name": "Kog'Maw", "rationale": "Kog'Maw reads as an Artillery Mage–style marksman who specializes in extreme-range sustained damage and siege pressure. Mechanically he forces engagements around empowered basic attacks and timed attack windows that trade fragility for reach: his kit extends and converts auto-attacks into long-range, max-health–scaling magic damage while offering brief attack-speed amplification and tools to shape enemy positioning with a slowing area and long-range artillery poke. Strategically he serves as a rearline damage engine and objective shaper—punishing overextensions, melting high-health targets over time, enabling safe poke-and-siege play, and providing a delayed, unavoidable explosive death effect that can decisively influence skirmishes and zone control."}
{"name": "LeBlanc", "rationale": "LeBlanc functions as an Assassin — a short-duration burst mage whose core role is killing priority targets through rapid, deceptive trades. Her mechanical identity centers on combo sequencing and illusion manipulation: she layers a mark to amplify follow-up spells, rewinds positional options with a teleport that leaves a return, amplifies her last used tool via a mimic, and deploys fake cues to confuse opponents. This kit rewards precise timing, conditional commits, and baiting opponents into misreads. Strategically she provides high single-target pick potential, lane-roam and skirmish pressure, and an outplay-oriented in-and-out playstyle that trades sustained presence for sudden, decisive burst and deception."}
{"name": "Lee Sin", "rationale": "Diver — Lee Sin embodies the diver archetype through aggressive, short-range engagement and high personal mobility that lets him enter fights, trade, and exit on his own terms. Mechanically he functions as a mark-and-dash skirmisher that chains skillshots and targeted dashes into bursty single-target follow-ups, augmented by an attack-speed–based passive and a temporary sustain window that reward extended trades. His kit trades range for precision: tools to reveal and mark targets, a mobility toolkit that repositions him or allies, area-marking that enables follow-up crowd control, and a displacement ultimate that both isolates targets and creates impactful teamfight chaos. Strategically he is a proactive playmaker and strong duelist who supplies isolation and pick potential, reliable gank and flank pressure, objective threat through single-target removal/forced repositioning, and situational peel via ally protection—serving as a high-skill champion that converts mechanical sequencing into outsized tactical leverage."}
{"name": "Leona", "rationale": "Leona is a Warden — a front-line, hard-engage support who specializes in locking down targets and absorbing damage for her team. Mechanically she is a commitment-driven initiator that layers brief, high-impact control windows with ally-enabled damage: she applies persistent marks that allow teammates to amplify burst, uses a targeted dash and proc-stun to close and pin priority targets, and sacrifices mobility flexibility for extended, reliable crowd control backed by a defensive stance that converts durability into an area disruptive detonation. Strategically she offers dependable initiation, layered peel and zone denial—creating framed windows for allied follow-up, winning short skirmishes, anchoring teamfights, and enabling coordinated target execution through chained CC and marked-target synergies."}
{"name": "Lillia", "rationale": "Lillia reads as a Skirmisher: a mobile, AP-centered duelist who shapes fights through sustained area pressure rather than single-hit burst. Mechanically she centers on applying a persistent mark that deals percent‑health damage and heals her, combined with wide sweeping attacks, a rolling skillshot that slows and reveals, and a mobility strike that lets her reposition into optimal impact zones; her finishing tool converts marked enemies into a brief sleep that rewards follow‑up damage. Strategically she supplies prolonged AoE burn against frontlines, reliable objective and wave pressure through damage-over-time, strong flank and kiting potential, and single-target pick setups via slows, reveal, and the sleep-window for coordinated burst."}
{"name": "Lissandra", "rationale": "Lissandra is an Artillery Mage: she excels at long-range initiation and layered area denial through persistent, autonomous ice threats and heavy crowd control. Mechanically she builds and controls evolving zones—placing untargetable pursuers that slow and detonate, firing piercing projectiles that widen and extend, projecting a reactivatable ice tether for repositioning, and offering a versatile ultimate that either locks down an enemy or self-entombs for protection and sustain. Her play relies on sequencing these tools to chain immobilization, punish mispositioning, and convert pokes into picks; she sacrifices constant mobility for powerful, commit-heavy crowd control. Strategically she supplies reliable single-target lockdown and multi-target suppression, objective zoning, siege control, and both initiation and peel in teamfights."}
{"name": "Lucian", "rationale": "Lucian is a Marksman defined by rapid, short-window trades and high mobility. His kit enforces an ability-weave rhythm—casts automatically trigger a follow-up basic attack—so mastery revolves around timing abilities to layer empowered autos for sustained single-target pressure. He uses linear poke and marking projectiles to pressure and track enemies from range while a quick dash lets him constantly repoint, dodge, and maintain optimal spacing. His channeled, forward-facing barrage converts that weaving into a prolonged execution tool for fleeing or isolated targets. Strategically he supplies consistent, precision-focused ranged damage, lane dominance and skirmish-winning capacity, excelling at hit-and-run trades, target pressure, and pursuit."}
{"name": "Lulu", "rationale": "Lulu is an Enchanter support because her kit prioritizes ally empowerment, protection, and soft crowd control over raw damage. Mechanically she orbits a persistent faerie companion that augments basic attacks and can be redeployed to allies or enemies to shift where pressure lands; this is paired with long‑range poke and slows, a versatile single‑target disable that can instead grant offensive buffs, and a targeted protective empowerment that increases survivability while generating a local zoning aura. Strategically she offers reliable lane harassment and sustained peel, enabling carries through shields, attack‑speed and mobility boosts, tempo control via slows and disruption, and a teamfight safety net that turns focused aggression into controlled skirmishes."}
{"name": "Lux", "rationale": "Artillery Mage — Lux functions as a long-range poke and zoning caster whose identity centers on projecting control and burst from safety. Mechanically she leverages a mark-and-consume rhythm: her spells tag foes and are amplified by targeted follow-up, rewarding skillshot hits, timed detonations and ability sequencing while sacrificing mobility for extended reach. The kit blends single-target lockdown, persistent area threats, a defensive shield that projects outward and returns, and a high‑impact linear ultimate that punishes poor positioning and provides brief vision. Strategically she provides reliable poke, area denial and pick setup, layered burst for focused targets, protective utility for allies, and teamfight shaping from a backline posture."}
{"name": "Malphite", "rationale": "Malphite reads as a Diver — a heavy engage tank whose mechanical purpose is to close distance reliably and convert his bulk into disruptive initiation. His kit centers on self-scaling survivability via a health-tied, regenerating shield and layered armor buffs that let him absorb frontline punishment, while tools that slow and deal localized area damage enable short trades and zone control. The signature, displacement-immune engage delivers concentrated AoE disruption and airborne crowd control to lock targets in place. Strategically he functions as a primary initiator and space-controller: forcing teamfights on favorable terms, creating windows for allied follow-up, isolating high-value targets, and serving as a durable front line that trades durability for decisive, short-duration crowd-control pressure."}
{"name": "Malzahar", "rationale": "Malzahar is an Artillery Mage: a long-range control caster that prioritizes zoning, sustained pressure, and single-target lockdown over mobility. His mechanical identity centers on applying a persistent damage-over-time affliction that is refreshed by his disruptive spells, building an internal void resource while casting that can be consumed to spawn autonomous attackers; he also intermittently gains a protective status that mitigates damage and status effects until broken by enemy hits. He trades mobility for safety and layered control—long-range silence, area denial and a channeled suppression that locks and reveals a target. Strategically he supplies reliable pick and execution potential, waveclear and objective pressure via summoned minions, and durable zoning and peel for allies rather than serving as a primary engager or roamer."}
{"name": "Maokai", "rationale": "Maokai is a Warden — a durable frontline controller that defines space through disruptive crowd control and sustained presence. Mechanically he blends on-hit sustain that scales with spell interactions, a targeted untargetable gap-close for guaranteed single-target lockdown, short-range displacement and slows for peel and disruption, autonomous scout/projectile units that patrol and punish approach paths, and a sweeping advancing wall that enforces zoning and roots. Those elements combine into a kit built around layered lockdown, area denial, and survivable initiation: he initiates and anchors fights, chains reliable CC to lock priority targets or protect allies, and controls objective and lane terrain to shape teamfights."}
{"name": "Master Yi", "rationale": "Skirmisher — a melee duelist built around sustained single-target combat and takedown-driven momentum. Mechanically he stacks and consumes layered hits to amplify individual strikes, uses a brief evasive/targeted multi-hit to apply on-hit effects and reposition, temporarily converts attacks into high-impact damage bursts, and gains potent mobility, attack-speed and crowd-control immunity when he secures kills. He also has a channel that provides burst self-healing, damage mitigation, and passive stack generation. This kit emphasizes stacking, on‑hit interaction, takedown resets, and risk-reward windows where vulnerability is exchanged for extreme sustained DPS. Strategically he provides reliable single-target hunting, clean-up and split-pressure, strong chase/escape through brief invulnerability and cleansing, and a snowballing duelist role that punishes isolated targets and extended skirmishes."}
{"name": "Mel", "rationale": "Mel reads as an Artillery Mage: a long‑range spellcaster who shapes fights with skillshot poke, zone control and decisive burst. Mechanically she accumulates a stacked resource on enemies via spells and attacks that stores escalating magic damage and converts sustained pressure into executes—either passively when stacks become lethal or through a concentrated detonation—while a brief defensive window that grants invulnerability to most damage plus a mobility boost lets her reposition safely to maintain uptime. Strategically she compresses poke, crowd control and area denial into a single role: she sieges and zones, locks and punishes priority targets, and transforms layered pressure into multi‑target finishes and teamfight swing potential."}
{"name": "Milio", "rationale": "Enchanter — Milio embodies a support enchanter who augments allies rather than dealing damage directly, because his toolkit centers on empowering teammate actions, providing shields, heals, cleanses, movement utility, and extended attack reach. Mechanically he functions around an ally-enchantment layer that causes allied offensive actions to trigger secondary ignitions and lingering burns, combined with a guided displacement projectile that creates pick-and-peel opportunities and area slow; he also deploys a mobile flame sentinel that trails allies to extend their range and stream healing, plus stockpiled defensive barriers and an AoE restorative exhalation that removes certain crowd control and raises tenacity. Strategically he supplies sustained teamfight survivability, proactive peel and counter-engage tools, tempo control through ranged threat and zoning, and amplifies skirmish and objective trades by turning ally autos and abilities into amplified, protectable follow-up damage and sustain."}
{"name": "Miss Fortune", "rationale": "Miss Fortune is a Marksman with an artillery-style identity—she functions as a precision ranged DPS who specializes in layered area and directional damage rather than sustained melee skirmishes. Mechanically she centers on rewarding target selection and timing: a mark-based on-hit engine that amplifies damage when hitting fresh targets, a ricochet/poke dimension that spreads on-hit effects, a movement-speed steroid that incentivizes careful downtime and aggressive repositioning, and large-area and channeled cone damage tools that shape fights. Strategically she delivers lane pressure and objective control through poke and wave manipulation, strong zoning and angled teamfight execution with high cone/AoE burst windows, and reliable kiting and peel when positioned correctly, making her a team’s primary ranged damage and zoning toolkit that trades mobility for empowered, timing-dependent volleys."}
{"name": "Mordekaiser", "rationale": "Mordekaiser is a Juggernaut — a heavy, self-sustaining frontliner and single-target duelist who enforces prolonged fights through applied pressure and enforced isolation. His mechanical identity revolves around sustained melee stacking that converts into an area-pressure state, a damage-capture shield economy that turns offense and incoming damage into temporary protection, and deterministic tools that reveal, pull, and banish enemies while temporarily siphoning their offensive and defensive attributes to amplify himself. Strategically he delivers dependable frontline sustain and objective control, punishes isolated priority targets, creates reliable windows to remove enemies from engagements, and excels in extended trades and split engagements where durability, percent-based sustained damage and zoning dictate tempo."}
{"name": "Morgana", "rationale": "Morgana functions as an Artillery Mage whose toolkit centers on long-range pick, area denial, and protective utility: she fits the class by delivering threatening single-target snares and lingering ground pressure from a distance while also offering a defensive shield that alters enemy crowd-control windows. Mechanically she is a control-and-trade mage that punishes positioning, sustains through damage-to-heal interactions, and sequences a catch-then-zone rhythm—land a bind, force enemies into persistent ground damage and proximity threats, and time shields to enable aggression or peel. Strategically she brings reliable pick potential, persistent teamfight zoning and objective control, anti-CC protection for carries, and a playmaking presence that forces opponents to respect positional constraints."}
{"name": "Naafiri", "rationale": "Naafiri is a Skirmisher because she specializes in close-range isolation and sustained dueling rather than long-range zoning or front-line durability. Mechanically she operates as a pack-centered melee skirmisher: her identity leans on summoned companions that mirror and amplify her aggression, a repeatable pressure tool for multi-target harassment, a gap-closing angled strike that culminates in an area burst, and a coordinated mark-and-dash that consolidates focus on a single victim; her kit rewards chained aggression and converts successful strikes and takedowns into renewed offensive tempo. Strategically she brings reliable pick-and-chase pressure, excels at collapsing on isolated carries and winning short trades, and functions as a mobile threat that forces opponents to respect flanks and limits safe positioning, trading sustained teamfight front-line control for lethal close-range ambush and objective contesting capability."}
{"name": "Nami", "rationale": "Nami is an Enchanter: her design centers on empowering allies, providing sustain, and enabling movement in fights while also offering selective crowd control. Mechanically she functions as a timing-and-positioning support who links skillshot CC, a bouncing heal/damage effect that alternates targets, and an on-hit empowerment that turns allied attacks and abilities into chase-or-trade tools; her kit rewards landing spells on allies and sequencing buffs and CC to create follow-up windows. Strategically she supplies lane sustain and enhanced trades, reliable peel and pick setup through single-target suspension and frontal displacement, wave and zone control in teamfights, and systemic mobility enablement that turns allied strengths into coordinated engagements and disengages."}
{"name": "Nasus", "rationale": "Nasus reads as a Skirmisher — a melee scaling duelist who transitions from lane bully to frontline brawler. His mechanical identity is built around a permanent, empowerable basic attack that grows stronger with sustained farming and takedowns, complemented by innate sustain that rewards extended trades. He enforces single-target control with a crippling, decaying slow and exerts area denial and armor reduction through a lingering ground zone, while a timed transformation dramatically boosts his bulk, reach, attack cadence, and adds a percentage-based aura of damage. Strategically he provides disciplined split-push and objective pressure, reliable isolation of priority targets, durable frontline presence in prolonged fights, and simple, high-ceiling carry potential that scales with time and uptime."}
{"name": "Nautilus", "rationale": "Nautilus is a Warden: a heavily armoured frontline engager whose identity centers on hard crowd control and space control. Mechanically he operates by chaining layered displacement and lock-down—a gap‑closing/terrain interaction to initiate, a passively applied on‑hit root to punish targets who try to escape, area slows for zoning, sustained defensive sustain that converts his attacks into persistent area pressure, and a pursuing ultimate that singles out and amplifies CC on a primary target. Strategically he provides reliable hard engage and peel, single‑target pick potential, disruptive frontline presence that dictates enemy positioning, and consistent objective and teamfight zoning through timed chains of lockdown."}
{"name": "Neeko", "rationale": "Neeko functions as an Artillery Mage because her core play centers on ranged, area-focused magic damage and layered crowd control rather than sustained trading or auto-attack dueling. Mechanically she is built around deception and burst sequencing: a persistent disguise and clone system that creates ambiguity and enables surprise engages, a stacking on-hit mechanic that converts a basic attack into an empowered strike with mobility, area spells that can re-trigger on kills to chain burst across multiple targets, and a skillshot-driven root that strengthens with successful hits plus a telegraphed, high-impact area knockup/stun ultimate. Strategically she provides pick potential and deceptive lane pressure, reliable siege and waveclear through repeatable AoE bursts, and heavy teamfight zoning and follow-up CC—rewarding setups, flanks, and coordinated crowd-control chains rather than isolated sustained damage."}
{"name": "Nidalee", "rationale": "Nidalee is a Specialist because her identity is built around two fundamentally different combat modes she must switch between to be effective: long‑range, prediction‑based poke and trap/utility play versus short‑range, high‑movement melee execution. Mechanically she revolves around form swaps that let her layer distant skillshot pressure, concealed area control and targeted sustain with an alternate kit that prizes mobility, empowered basic attacks and gap‑closing leaps; success depends on chaining ranged harassment and vision denial into safe closes or disengages using cougar mobility. Strategically she supplies long‑range pick and zone control, isolated target hunting and skirmish conversion, plus niche sustain/attack‑speed support—rewarding precision, map awareness and timing when committing to melee engagements."}
{"name": "Nilah", "rationale": "Nilah reads as a Skirmisher: a mobile, melee duelist who excels in close-range exchanges and sustained fights while uniquely amplifying the survivability of an adjacent ally. Mechanically she converts offensive investment into effective penetration, heals herself from champion damage and transforms excess healing into a short-lived personal buffer, while relying on charge-limited gap-closing mobility and a brief evasive movement that can be transferred to allies on contact to create a shared protective window. Her kit also supplies localized disruption and a damage-to-heal conversion that benefits nearby teammates. Strategically she delivers lane-level partnership and localized teamfight leverage—enabling aggressive coordinated engages, creating frontline pressure and pick threat, improving ally sustain and peel in close-quarter skirmishes, and forcing opponents to respect a high-mobility, self-sustaining melee presence that trades favorably in protracted brawls when supported by positional coordination."}
{"name": "Nocturne", "rationale": "Nocturne reads as an Assassin/Diver: a champion designed to close gaps quickly and eliminate priority targets through committed engagement rather than extended teamfighting. Mechanically he is built around shadow mobility and conditional offensive spikes—he creates and uses traversal paths and a targeted dash to ignore zoning and reach backline carries, while short-burst attack empowerment, attack-speed windows and on-hit sustain let him trade aggressively in short skirmishes. His kit rewards timing and isolation, with defensive counters that convert into increased offensive tempo and a persistent crowd-control tether that punishes failure to break contact. Strategically he provides reliable pick threat, forces repositioning via vision denial, and serves as a flank-oriented initiator and single-target execution tool that thrives in skirmish-heavy compositions."}
{"name": "Nunu", "rationale": "Nunu & Willump embody a Warden: a durable, disruptive frontline built to protect allies, deny space and initiate fights. Mechanically the kit revolves around high‑commitment positioning and timing—momentum-based gapclosing that grants forced CC while bypassing slows, a holdable channel that must be timed to detonate for maximum disruption, a self-sustaining bite that doubles as reliable objective execution, and short projectile stacks that apply crowd-control effects; a team‑wide tempo passive rewards dealing damage to key targets by temporarily boosting ally movement and attack speed, prioritizing the quickest attacker. Strategically, Nunu delivers consistent initiation and zoning, objective control and monster security, frontline peel via shielding and slows, and tempo tools that set up and finish fights when his channels and engages land."}
{"name": "Olaf", "rationale": "Olaf is a Skirmisher — a brute-force melee duelist who excels at committed, auto-attack–forward fights and thrives when exchanges become dangerous. Mechanically he converts vulnerability into power: his offense and sustain scale as his health declines, he manages a thrown-axe resource for ranged poke and cooldown manipulation, and his execute trades health for guaranteed damage and potential healing while basic attacks accelerate his finish window. His ultimate grants temporary CC immunity and tankiness to force dives. Strategically he brings dependable single-target kill pressure and objective contention, strong stick-to-target play, simple armor-reduction utility for focused fights, and a reliable way to ignore crowd control to close or finish skirmishes."}
{"name": "Orianna", "rationale": "Artillery Mage — Orianna functions as a mid-range control mage whose identity is built around a single mobile tool (the Ball) that extends her spells. Mechanically she is defined by commanding that companion: all offense, defense and crowd control are delivered through its position, so play revolves around pre‑positioning the Ball, timing its movement to avoid interrupting her own casts, and weaving basic attacks to amplify her spell damage. Strategically she provides layered zone control and teamfight engine power: reliable mid-range poke and wave management, a protective transferable shield and mobility buff for allies, and a decisive area pull/stun that allows her to set up engages, peel, and win clustered fights when the Ball is correctly placed."}
{"name": "Ornn", "rationale": "Ornn is a Warden — a front-line disruption tank that anchors fights by shaping space and imposing hard displacement rather than by high mobility. Mechanically he centers on long-range, comboable disruption: terrain creation and collision-driven knockups with a recast redirect produce predictable windows for follow-up, while a brittle application amplifies subsequent crowd control and damage. Beyond raw CC, he offers a unique non-combat support role by forging Masterwork upgrades for himself and allies and enabling purchases from afar, turning individual scaling into team utility. Strategically he provides reliable initiation, peel, siege denial and objective control through positional dominance and durable engagement tools."}
{"name": "Pantheon", "rationale": "Diver — Pantheon is a short-range, commit-heavy engager who specializes in single-target initiation and follow-through. His kit revolves around stacking a resource that empowers his next basic ability, a wind-up long-range poke that can be recast, a targeted leap that interrupts and converts into rapid multi-hit autos, a directional shield-channel that blocks enemy damage while projecting a damaging cone, and a high-impact descent that creates area slow and a travelling shockwave on arrival. Mechanically he alternates between charged ranged pressure and brute close-quarters commitment, trading mobility for burst and survivability during his channel. Strategically he provides reliable pick initiation, selective frontline durability, lane-bully trading tools, and global pressure for cross-map skirmishes and coordinated engages."}
{"name": "Poppy", "rationale": "Poppy reads as a Warden: a durable front-line disruptor whose identity is built around space control, interruption and single-target containment rather than raw ranged damage. Mechanically she weaves together a returned projectile that rewards precision with a temporary health-scaled barrier, a ground-targeted impact that creates a slow field and a repeating rupture, a passive defensive buffet that amplifies survivability and emits an anti-mobility aura, a carry-forward dash that converts movement into a terrain-pin, and a charged, long-range knockback with a windup. Strategically she supplies immutable anti-mobility and peel, reliable terrain-based lockdown and single-target denial, predictable teamfight timing and objective zone control while anchoring the front line and enabling allied follow-up."}
{"name": "Pyke", "rationale": "Pyke reads as an Assassin: a mobility-first finisher designed to single out and remove isolated targets rather than sustain prolonged fights. Mechanically he blends stealth-based approach tools with a directional reposition that creates a brief area stun and a skillshot harpoon with an empowered recast for hard picks, while converting incoming damage into a recoverable resource that can be consumed from concealment and trading bonus survivability into offensive power. Strategically he provides high single-target execution and roam playmaking, enabling fast picks and snowballing skirmishes, forcing opponents to respect flanks and short windows of vulnerability, and rewarding precise timing and coordination."}
{"name": "Qiyana", "rationale": "Assassin — Qiyana functions as a high-mobility, high-burst melee assassin who specializes in single-target execution and short-window skirmishes, fitting the assassin archetype through her emphasis on rapid gap-closing and lethal combos. Mechanical identity — her kit revolves around claiming nearby terrain to temporarily empower basic attacks and spells, creating conditional ability transforms and resets that reward proactive positioning and map-awareness; she layers a mobility dash for approach, a directional strike that becomes augmented when empowered, and an ultimate that manipulates space and displaces enemies. Strategic function — she provides acute threat-making: isolating and eliminating priority targets, forcing fights around terrain, enabling opportunistic roams and picks, and offering zone control and disruption through terrain-triggered crowd movement rather than sustained frontline presence."}
{"name": "Quinn", "rationale": "Quinn is a Skirmisher — a mobile, single-target duelist that prioritizes hit-and-run trades and high roam potential. Her kit is built around applying and consuming a Vulnerable mark to amplify basic attacks and make spell-weave combos rewarding, producing a repeated on‑hit burst rhythm that prizes proper attack-timing. She pairs strong mobility and a temporary transformed movement state that grants extended map traversal with targeted disruption and vision-denial tools, trading sustained multi-target control for rapid isolation and displacement. Strategically she supplies dependable pick-and-execute pressure, lane bullying and split-map tempo: isolating priority targets, collapsing or disengaging skirmishes, and converting roams into objective and territorial advantage."}
{"name": "Rakan", "rationale": "Rakan reads as a Skirmisher with strong enchanter undertones: a mobile playmaker built to dart into fights, initiate picks, and thread protection between allies. Mechanically he is defined by layered movement and conditional survivability — a regenerating personal barrier that rewards offensive engagement, self-sustain from targeted poke, a two-stage ally shield/reposition mechanic, and an unblockable, collision-driven mobility window that applies crowd control while moving through enemies. The kit prioritizes timing and sequencing over raw damage, rewarding players who weave pokes to refresh defenses and chain-positioning tools to lock targets. Strategically, Rakan supplies reliable primary engage and pick potential, lightweight peel and single-target protection, roaming pressure to create numbers advantages, and disruptive front-line presence that enables skirmishes and flank-driven teamfight openings."}
{"name": "Rammus", "rationale": "Diver — Rammus functions as a tanky engager who commits into fights to disrupt priority targets and absorb punishment. Mechanically he marries high-mobility initiation with a defensive-damage rhythm: he uses gap-closing and long-range approaches to force contact, then converts raw defenses into offensive threat through on-hit spell damage and reflection while adopting a protective stance that increases his survivability and retaliation. His toolkit emphasizes single-target provocation, area disruption on impact, and self-buffed attack cadence to maintain pressure once engaged. Strategically he provides reliable primary engage and peel, strong frontline durability and objective control, zone denial through impactful collisions and slows, and a punish for poorly positioned or auto-attack–reliant enemies, shaping fights by forcing targets into disadvantageous proximity."}
{"name": "Rek'Sai", "rationale": "Skirmisher: functions as a mobile, single-target duelist and map-pressure jungler who excels at hunting isolated targets and contesting objectives. Mechanical identity: built around stance-swapping and resource cycling — a short-lived Fury bar that fuels sustain and an empowered bite when managed, a burrowed state that trades range for stealth-like detection and sustain, and persistent tunnels that create unorthodox mobility corridors; additionally she marks targets to enable a displacement-immune, targeted pounce that finishes based on missing health. Strategic function: provides reliable pick and execute threat, sustained dueling and objective contest tools, lane pressure through unexpected rotations and tracking, and localized disruption on re-emergence to force favorable engagements."}
{"name": "Rell", "rationale": "Rell is a Warden because her toolkit is built around tanky frontline initiation and multi-target crowd control that locks space and protects allies. Mechanically she toggles between a mobile mounted stance and a zone-controlling dismounted stance, layers a persistent resistance-reducing debuff that both weakens enemies and is converted into her own defenses and damage, and combines shield-destruction with routine stuns, displacements, a tethered pull and a standing damaging field. Strategically she functions as a reliable engage and disruption engine: she opens fights, punishes clustered opponents, denies space around objectives, provides frontline peel and ally mobility, and converts enemy durability into sustained frontline presence for her team."}
{"name": "Renata Glasc", "rationale": "Renata Glasc reads as an Enchanter-Disruptor support: she combines ally-focused protection and empowerment with disruptive crowd-control and repositioning to shape engagements. Mechanically she centers on applying a consumable damage-amplifying mark that coordinates allied follow-up, enabling windows for concentrated burst or sustained DPS, while offering a targeted lockdown and forcible displacement to pick or isolate priorities. Her kit further grants conditional offensive empowerment that refreshes on takedowns plus area shielding and slow, creating layered safety for commits. Strategically she brings pick potential, allied DPS enablement and aggressive windows, reliable peel and protective utility, and strong teamfight manipulation through zoning and forced enemy disarray."}
{"name": "Renekton", "rationale": "Renekton is a Diver — a melee bruiser designed to close gaps, lock down priority targets, and contest frontline space through committed short-range engagements. Mechanically he revolves around a Fury resource that builds in combat and temporarily empowers his next ability, incentivizing burst windows and aggressive trades; his kit layers repeated mobility and gap-closing tools with a built-in interrupt/stun and self-sustain, while a transformative ultimate spikes his bulk, reach, and area presence with a damaging aura. Strategically he provides reliable single-target kill pressure and initiation in short, decisive skirmishes, lane dominance through sustained trades and healing, and a frontline zoning/peel role when transformed that forces opponents to respect close-range threat."}
{"name": "Rengar", "rationale": "Rengar is a Skirmisher: a mobile, single-target melee hunter built to stalk and burst isolated opponents. Mechanically he revolves around a stacking resource that empowers a next ability into an extra cast and a brief movement surge, enabling combos that mix empowered auto-attacks with on-demand utility and gap closure. His toolkit trades prolonged sustained damage for concentrated short-window burst and conversion of recent damage into self-healing, while offering a targeted slow/reveal and a camouflage stalking state that locks vision on a chosen foe. Strategically he brings reliable single-target assassination and dueling, pick pressure and jungle/lane skirmish dominance through stealth-based initiation and isolation control."}
{"name": "Riven", "rationale": "Riven reads as a Skirmisher: a high-mobility melee duelist built for short, decisive trades and isolated confrontations rather than prolonged sieges. Mechanically she revolves around chaining a limited-resource offensive passive with a multi-cast combo toolkit that mixes burst damage, displacement and short dashes with a defensive dash-shield and a brief stun—then a temporary empowerment that lengthens reach and grants a long-range execute. Her play is combo- and timing-oriented, rewarding animation-cancels, precise charge management and positional windows to convert mobility into damage. Strategically she offers pick and flank pressure, reliable single-target kill threat and split-push/duel dominance, while supplying localized disruption and a safety buffer in melee engagements."}
{"name": "Rumble", "rationale": "Rumble fits the Artillery Mage archetype because he specializes in sustained close-to-mid-range area damage and persistent zoning that controls enemy movement rather than pure single-target burst. His mechanical identity revolves around a build-and-spend resource (Thermal) that rewards continuous ability use by gating amplified states; maintaining those states amplifies his sustained cone damage, personal defenses and mobility, and converts autos into meaningful on-hit magic damage that scales with targets’ durability. He layers soft control and resistance reduction through repeatable projectiles while delivering a long-duration ground field that reshapes fight geometry. Strategically, he brings durable, predictable area denial and midline peel—excellent for forcing choke fights, securing objectives, and punishing flanks—trading raw mobility for consistent pressure and zone leverage."}
{"name": "Ryze", "rationale": "Ryze is a Battlemage: a spell-first caster whose design emphasizes sustained, high-impact spellcasting and single-target control rather than auto-attack trading or mobility. Mechanically he centers on building and spending a layered resource and mark system that lets him chain spells for amplified effects, rewarding precise combos, target sequencing, and positional setup while trading personal dash-style mobility for powerful ranged toolkit interactions and a channelled portal ability that repositions allies. Strategically he contributes reliable pick and peel through focused crowd control and chained damage, strong lane and wave pressure via spell spreading, and unique rotational/objective leverage by enabling coordinated team repositioning and tempo plays that hinge on timing and setup."}
{"name": "Samira", "rationale": "Skirmisher — Samira is designed as a close‑quarters duelist who converts momentum into combat power, fitting the skirmisher archetype because she thrives in fast, high‑risk one‑on‑one and small‑group fights rather than as a pure backline marksman. Mechanically she builds and spends momentum through consecutive hits and ability combos, alternates between ranged and melee options to prize proximity, and gains mobility to enter fights and reposition; she also provides a defensive counterplay by nullifying incoming projectiles while spinning. Strategically she offers a gap‑closing, sustained single‑target threat that snowballs with successful trades, a reliable dive and disruption tool in skirmishes and team fights, and a high‑variance carry option that demands space and timing to be effective."}
{"name": "Sejuani", "rationale": "Sejuani is a Vanguard — a front-line engager whose identity is centered on heavy, chained crowd control and durable disruption. Mechanically she revolves around applying and consuming Frost stacks to convert layered pressure into reliable immobilization, pairing a long-range, distance-empowered projectile with a forward charge that interrupts and displaces enemies and a sweeping area effect that pushes and slows. She also sustains a defensive armor layer after taking significant hits, so her impact is a blend of initiation and survivability. Strategically she functions as a primary engage and peel engine, providing multi-target lockdown, objective zone control through displacement and slows, and a forgiving frontline that enables allied follow-up and coordinated wombo plays."}
{"name": "Senna", "rationale": "Senna reads as an Artillery Mage–style marksman-support hybrid: a long-range poke and utility specialist who shapes engagements from safety. Her mechanical identity centers on empowered on‑attack beams that apply and then consume a lingering mist, converting sustained poking into scalable single-target payoff and rewarding repeated ranged pressure; that core on‑hit loop is paired with long-range supportive waves that heal allies and a global protective strike. She also generates persistent zone control via clinging mist and delayed crowd control and a short camouflage aura that enables concealed ally repositioning. Strategically she brings reliable long-range pressure and sustain, pick and zone control tools to set up fights, and global defensive peel and shielding rather than frontline engage."}
{"name": "Seraphine", "rationale": "Seraphine reads as an Enchanter with artillery tendencies: she is built around long-range, team-focused utility and layered area pressure rather than single-target dueling. Mechanically she rewards chaining and timing — casting patterns (including ally casts) build temporary resources that extend her basic attack reach, empower double-casts, and amplify subsequent spells, so her play revolves around orchestrating sustained poke, empowered autos, and sequenced spell bursts. Strategically she supplies reliable off‑angle poke, multi-target crowd-control windows, and proactive protection through shields and movement‑speed support, making her a teamfight conductor who enables siege and skirmish control, secures engages or disengages, and magnifies allied follow-up rather than hunting solo kills."}
{"name": "Sett", "rationale": "Sett is a Diver — a melee brawler who thrives by closing onto priority targets and forcing short, brutal exchanges. His mechanical identity centers on alternating basic attacks with an empowered strike, a grit resource that builds from damage taken and converts into a defensive buffer and bursty area follow-up, and reliable gap-closure plus forced repositioning to isolate or amplify targets. Strategically, Sett functions as a front-line duelist and single-target engager who both initiates fights and punishes isolated enemies, provides layered crowd-control and displacement to enable allied follow-up or peel, and turns extended trades into wins through sustain and execute-style burst."}
{"name": "Shaco", "rationale": "Shaco is an Assassin: his identity centers on stealth, surprise, and high single-target burst enabled by positioning rather than prolonged dueling. Mechanically he functions as a deception-based skirmisher that rewards flanking and timing—he uses brief invisibility and blink-like repositioning to set up enhanced rear attacks, deploys stealthed traps to deny vision and briefly disrupt enemy movement, applies on-hit slows and a ranged slowing/damage tool for engage and finish, and fields a disposable decoy that continues to threaten space and damage after his departure. Strategically he is a pick-creator and roamer who converts isolated kills into map pressure, enforces cautious movement through trap zoning, and provides lightweight split-push and disruptive teamfight presence by forcing enemies to react to deception and area denial."}
{"name": "Shen", "rationale": "Shen is a Warden: a tanky protector whose design emphasizes damage mitigation, target manipulation, and ally preservation. Mechanically he revolves around a persistent spirit weapon and an internal shield resource that he deploys through timing and positioning to empower extended-range melee pressure, create small interception zones that negate enemy basic attacks, and forcibly draw enemy focus via a targeted taunt while relocating himself. The kit rewards coordinated timing—refreshing defensive uptime by impacting multiple enemies, trading extended basic attacks against durable foes, and committing a global-channel rescue that both grants a temporary shield and instantly transports him to an ally. Strategically he supplies reliable peel and single-target saves, predictable initiation and disruption, sustained frontline durability, and decisive global presence that secures fights around objectives and enables safer plays for his team."}
{"name": "Shyvana", "rationale": "Shyvana functions as a Diver: a high-commitment melee initiator who transforms to close gaps, absorb disruption while displacing and carrying enemies, and force short-range engagements. Mechanically she is a sustained on-hit skirmisher whose kit rewards repeated basic attacks and aura uptime, trades mobility for potent close-range area damage and a form-based power spike, and is built around transforming into an empowered state that changes movement and combat behavior. Strategically she supplies dependable objective control and neutral-taker identity through dragon-focused scaling, rapid jungle clear and single-target neutral damage, reliable dive initiation and AOE presence in fights, and pressure by threatening isolation and extended brawls."}
{"name": "Singed", "rationale": "Singed is a Diver whose identity is built around forced proximity, sustained area denial, and single-target displacement. Mechanically he functions by generating persistent toxic space as he moves, using momentum-based mobility to repeatedly re-engage and extend encounters, and converting picks into extended crowd-control through a combo of fling and sticky zones. His toolkit refreshes effects through revisits and synergizes displacement with ground-control to lock targets into hazardous terrain while his self-buff window temporarily turns him into a durable, oppressive skirmisher that also applies anti-heal. Strategically he provides frontline disruption and zoning, reliable engage/peel through position manipulation, objective pressure via hazardous paths, and prolonged fight endurance that reshapes enemy movement."}
{"name": "Sion", "rationale": "Sion reads as a Diver: a committed frontline initiator who closes distance to displace and disrupt enemy formations with a high-commitment, momentum-driven toolkit. Mechanically he trades stop-and-go mobility for one-way commitment—charged, frontal disruption and an unstoppable, accelerating charge that enforces collision-based crowd control—while his longevity is driven by max‑health scaling and a shield that rewards bulk. His kit also includes persistent growth on takedowns and a unique post-death berserk window that converts elimination into a short-lived, fast melee threat that lifesteals and threatens big-health targets. Strategically he supplies reliable hard engage, area disruption and zone control, objective pressure through durable presence and execution threat, and a punish for overextended opponents that can finish fights even after he falls."}
{"name": "Sivir", "rationale": "Sivir is a Marksman because her design centers on sustained ranged auto-attack pressure and multi-target damage rather than single-target burst, serving as a primary sustained DPS and wave-control presence. Mechanically she is an attack-driven skirmisher that converts basic-attack uptime into battlefield control: short, repeatable empowered windows increase her attack cadence and projectile coverage, successful hits grant momentary mobility that reward aggressive repositioning and chase, and she has a single-use defensive tool that denies an enemy spell while restoring durability and triggering that mobility. Strategically she supplies reliable AOE waveclear and siege, consistent teamfight sustained damage, strong kiting and repositioning, a built-in counter to key enemy abilities, and a teamwide mobility engine that enables coordinated engages, disengages, and map tempo."}
{"name": "Skarner", "rationale": "As a Warden, Skarner acts as a durable frontline anchor that specializes in locking enemies down and controlling space through suppression and sustained pressure. His kit prizes prolonged contact: repeated melee strikes and empowered attack windows apply short‑lived stacking debuffs that culminate in health‑based burst damage, while an interruptible empowered strike can be converted into a ranged detonation for flexible engage or follow‑through. He pairs a large, health‑scaled shield and expanding area slow/damage for survivability and peel with a terrain‑bypassing dash that grants brief immunity to movement impairments for dependable gap‑closing and repositioning. His skewering suppression transforms picks into forced displacements, giving teams reliable initiation, objective control, and durable single‑to multi‑target lockdown that punishes prolonged trades and protects allies during commits."}
{"name": "Smolder", "rationale": "Smolder reads as a Skirmisher: a mobile duelist that scales through sustained engagement rather than burst windows, converting accumulated combat and last‑hit pressure into amplified spell effects. Mechanically he revolves around a stacking resource built from damaging champions and securing minions/monsters that augments his kit, merging targeted poke, area control, terrain‑traversing mobility that automatically pressures nearby foes, and a channeled frontal wave that provides self‑sustain and stronger punishment to enemies caught centrally. Strategically he supplies persistent 1v1/extended‑fight threat, zone and peel with slows and explosive follow‑ups, reliable sustain for prolonged skirmishes, and flexible split‑push and rotation potential via his terrain mobility."}
{"name": "Sona", "rationale": "Sona is an Enchanter support: a utility-focused, low-commitment backline champion whose toolkit centers on auras and ally-focused buffs rather than hard isolation or sustained frontline brawling. Mechanically she functions as a tag-and-proc spellcaster who accumulates and consumes passive charges through simple ability casts and basic attacks, trading direct mobility and durability for continuous ranged poke, periodic empowered autos, and conditional tempo gains when her movement-buff remains unbroken. Strategically she provides consistent lane pressure and sustain, layered movement utility to enable rotations or disengages, and a single, high-impact crowd-control ultimate that turns her diffuse support package into a decisive teamfight initiation or peel tool while primarily enabling and amplifying allied damage dealers."}
{"name": "Soraka", "rationale": "An Enchanter support built around reactive, high-impact healing and positional utility. Her identity is manipulating her own health as a resource to sustain allies, using restorative windows and returns from ranged harassment to reduce that cost and empower subsequent heals; she also gains directed mobility to reach critically wounded teammates. She shapes space with a persistent celestial zone that punishes enemy positioning and culminates in a disruptive crowd-control spike, while a global, low-health-prioritizing group heal provides battlefield-wide clutch saving potential. Overall she functions as a sustain-and-save specialist who controls fights through timely heals, zoning, and long-range rescue capability."}
{"name": "Swain", "rationale": "Swain is a battlemage who functions as a midline teamfight anchor rather than a pure burst caster; he embodies the Battlemage archetype by trading mobility for prolonged area presence, control, and sustained damage. Mechanically he revolves around harvesting persistent resources from enemy champions to convert into survivability and extended damage output—his toolkit combines revealing and rooting tools that set up recurring cone and AoE pulses, a transformation that prolongs combat through life-drain generation, and mechanics that reward re-engagements and isolated targets. Strategically he provides durable zone control and attrition: reliable midline pressure that punishes clustering, vision-enabled pick potential, objective control through sustained attrition, and a frontline threat that forces opponents to fight around his draining area rather than freely reposition."}
{"name": "Sylas", "rationale": "Sylas reads as a Skirmisher: a mobile melee duelist who thrives in short-range brawls and selective dives. Mechanically he revolves around generating and spending internal momentum to transition between bursty initiation and sustained close-quarters damage—combining a short-window repositioning tool into a follow-up displacement chain, stacking empowered basic attacks for rapid sustained output, and an on-hit life-recovery mechanic that rewards extended trades. His signature toolkit-level adaptability comes from temporarily appropriating enemy ultimate effects, letting him plug holes or amplify picks. Strategically he offers reliable single-target engage and execution, layered local disruption for skirmishes, sustained frontline pressure in teamfights, and flexible role coverage through his stolen ultimates."}
{"name": "Syndra", "rationale": "Artillery Mage — Syndra functions as a long-range burst mage who exerts control through conjured, interactable projectiles; she fits the artillery archetype because her core impact is delivered from range via precise, high-value spell combos rather than sustained dueling. Mechanically she is an object-based mage: her gameplay loop centers on creating and managing persistent spheres and a growth resource that amplifies her spells, then manipulating those objects to enhance displacement, add extra hits, and multiply damage; mastery comes from spatial placement, timed casts, and using held projectiles to alter ability outcomes. Strategically she brings potent single-target elimination and area denial—reliable lane shove and pick potential, zoning through knockback and short stuns, strong burst threat in skirmishes and teamfights, and requires teammates to capitalize on her ability to isolate or punish exposed champions."}
{"name": "Tahm Kench", "rationale": "Tahm Kench functions squarely as a Warden: a durable frontline whose core purpose is disruption and protection rather than pure damage. Mechanically he revolves around on-hit stacking pressure tied to his bulk, a stacking crowd-control tempo that culminates in lockdown, an instantaneous repositioning/engage that generates area disruption, a unique consume mechanic that can remove an ally or enemy from play and grant shielding or suppression, and a grey‑health system that converts received damage into delayed sustain—together these tools create a playstyle built on timed trades, target isolation, and baiting. Strategically he supplies reliable single‑target lockdown and peel, safe bodyblocking and ally safekeeping, and disruptive initiation that reshapes skirmishes and forces opponents to respond to his threat rather than bypass the frontline."}
{"name": "Taliyah", "rationale": "Taliyah functions as a Battlemage who reshapes the battlefield to trade positional advantage for ranged magic pressure. Mechanically she rewards terrain-aware play: movement and positioning near terrain grant mobility while her spells create persistent ground effects, volley-style projectile pressure, area slows, and a delayed displacement that forces enemy repositioning, with limitations that prevent repetitive casting in a single spot. Strategically she provides layered zoning and objective control, reliable waveclear and poke, and unique map-manipulation through a permanent wall that alters pathing—enabling roams, cross-map plays, picks via forced movement, and deliberate control of fight geometry."}
{"name": "Talon", "rationale": "Talon is an Assassin — a pure single-target skirmisher built to burst and roam from unexpected approaches; his identity centers on high mobility, short-window burst, and lethal priority rather than sustained fighting. Mechanically he stacks a bleed-like mark that primes a follow-up execute through autos, uses terrain vaulting to traverse and create unconventional attack angles with a per-passage limitation, and combines returning-dagger poke with a temporary stealth-and-rotational burst that amplifies trade windows and chase potential; eliminations grant sustain and restore his tempo by shortening his mobility cooldown. Strategically he provides reliable pick and roam pressure, punishes isolated targets, converts takedowns into snowball opportunities, and offers moderate wave control while avoiding prolonged front-line engagements."}
{"name": "Taric", "rationale": "Taric is a Warden because he centers on protecting allies and controlling space rather than solo damage. Mechanically he operates as a short-range support that empowers basic attacks to fuel healing and cooldown recovery, converts bonus defenses into both offensive and protective potency, and creates a persistent link with a teammate that shares and mirrors his defensive toolkit. He also offers a channeled area control effect that interrupts and a delayed areawide invulnerability that forces timing decisions. Strategically, he functions as a durable peel and teamfight anchor who enables aggressive engages or clutch survival windows through synchronized single-target mitigation, sustained heals, and timed global protection."}
{"name": "Teemo", "rationale": "Teemo functions as an Artillery: a ranged harassment and zone-control champion who shapes fights from a distance rather than winning through brute durability. Mechanically he centers on stealth-enabled positioning and hit-and-run pressure—remaining hidden to set up trades and gain transient offensive tempo when re-engaging—while sustained on-hit poison enforces prolonged punishment on targets that try to stay in range. He accumulates mobility when unbothered to kite or flank, and carries tools that temporarily neuter basic-attack-dependent foes. His stealthed area devices create persistent denial fields that slow and punish entry, converting vision control into objective and pick leverage. Strategically he provides reliable poke, map control, safe split-push pressure, and asymmetric pick potential, forcing opponents to contest space and invest resources in clearance and detection."}
{"name": "Thresh", "rationale": "Thresh is a Warden support built around long-range pick threat and layered crowd control. Mechanically he scales through a persistent collection resource that simultaneously augments his survivability and magical potency, and his kit revolves around tethered tools: a targeted displacement that initiates or confirms picks, a team-oriented rescue/redirect that can reposition allies, broad-area sweeps that forcibly move and slow foes, and temporary obstructive geometry that punishes entry. Strategically he functions as both a primary engage and peel engine—he creates pick windows, secures carries with proactive protection and relocation, controls space and chokepoints, and converts single-target hooks into decisive teamfight advantage through coordinated timing and positioning."}
{"name": "Tristana", "rationale": "Tristana is a Marksman defined by progressive reach and self-sufficient mobility: she embodies the ranged primary damage dealer archetype who scales into safer spacing through increasing attack range while maintaining high single-target pressure. Mechanically she revolves around auto-attack synergy and tempo windows—burst attack-speed phases combined with a resettable leap create a playstyle that chains kills or disengages on successful takedowns, while a stick-on timed explosion accelerates executes and enhances wave pressure; a powerful displacement offers both peel and offensive repositioning. Strategically she provides long-range sustained DPS, reliable pick and dive follow-through via resets, safe sieging and objective pressure from outranging threats, and built-in disruption/peel for her team."}
{"name": "Trundle", "rationale": "Trundle is a Skirmisher — a melee duelist built for prolonged, attritional fights that punish kiting and reward sustained proximity. Mechanically he enforces extended trades by combining an empowered attack and self-buffing presence with tools that alter battlefield geometry and directly leech resources from a single opponent, effectively converting enemy durability into his own; his kit favors sticking, raw sustain, and localized disruption over burst or ranged poke. Strategically, he offers dependable single-target removal and objective pressure: he isolates and weakens high-value targets, controls space to set up picks or protect flanks, anchors split-push threats, and turns drawn-out engagements into opportunities to outlast and out-gear opponents."}
{"name": "Tryndamere", "rationale": "Tryndamere is a Skirmisher: a melee duelist built to win extended one‑on‑one fights and force high‑risk all‑ins. Mechanically he centers on a charged resource that grows with aggression to amplify critical strike chance and can be consumed for meaningful sustain, combined with a missing‑health damage amplifier and a leap that both generates resource and secures positioning. His toolkit rewards trading at low health and using mobility to stick or disengage, while an ultimate creates a timed window of enforced survivability that enables reckless plays. Strategically he brings relentless split‑push and single‑target pressure, reliable tower‑diving and objective threat, and a carry‑focused disruption that demands committed crowd control or focused containment to neutralize."}
{"name": "Twisted Fate", "rationale": "Twisted Fate is an Artillery Mage — a long‑range spellcaster who combines multi‑target poke and empowered single attacks with unrivaled map mobility. His identity centers on cycling empowered basic attacks and stacking on‑hit effects into occasional burst, layered over a spread projectile that shapes waveclear and zone control, while a probabilistic gold‑on‑kill passive tweaks his resource tempo. His ultimate provides global reveal and a short‑range teleport, converting lane pressure into cross‑map playmaking. Strategically he offers sustained poke and wave control, a selectable single‑target utility option for picks or peel, and persistent global threat projection that forces enemy rotations and unlocks coordinated objective or pick play."}
{"name": "Twitch", "rationale": "Twitch reads as a Skirmisher-style marksman who plays like an assassin from range: he leverages concealment, poisoning, and extended reach to convert positioning into damage. Mechanically he relies on layering a persistent poison through repeated attacks and area control, amplifying effects when he times invisibility and movement to open fights; his kit detonates and scales with accumulated stacks and then switches his basic attacks into long-range, piercing projectiles for multi-target follow-through. Strategically he offers flank and ambush pressure, reliable backline shredding and prolonged single-target suppression, plus area denial that converts smart positioning into decisive teamfight and split-push value."}
{"name": "Udyr", "rationale": "Udyr functions as a Juggernaut — a melee brawler who dominates extended fights by trading durability for relentless close‑range pressure. Mechanically he centers on stance‑swapping: cycling between a set of empowered attack modes that modify his next hits and culminate in amplified final stances, creating a short‑cooldown, rhythm‑based playstyle rather than a traditional resource bar. The kit emphasizes on‑hit conversions, self‑sustain and shields, area harassment and movement windows with brief CC‑immunity, rewarding timing and weave management to stick and burst down targets. Strategically Udyr is a persistent frontline duelist and skirmisher who secures objectives, zones and disrupts backlines through sustained pressure and stickiness, forcing opponents to dedicate resources to contain him."}
{"name": "Urgot", "rationale": "Urgot is a Juggernaut — a durable, front-line fighter built to punish isolated enemies and secure kills through sustained, oppressive pressure. Mechanically he blends area-oriented ranged harassment with brutal close-quarters lockdown: his basic attacks trigger directional cone bursts that reward positioning and control space, he uses a placement-and-detonation tool to zone and set up engages, a high-force dash that displaces and stuns on collision to rearrange fights, and a mark-driven unstoppable pursuit state that prioritizes and relentlessly attacks marked targets, capped by a targeted suppression-execute. Strategically Urgot supplies single-target lockdown and guaranteed execution, reliable zone control to shape engagements, and a front-line anchor that creates pick potential and forces opponents into high-risk positioning choices."}
{"name": "Varus", "rationale": "Artillery Mage — Varus functions as a long-range poke and siege specialist who punishes poor spacing with charged skillshots and layered on-hit pressure. His mechanical identity centers on applying expendable stacks through basic attacks that are detonated by spells, creating windows of amplified burst that reward weaving autos and abilities rather than pure spell spam. He pairs a chargeable, extended-range projectile with an area-denial tool and a single-target immobilize that primes stacks, plus a kill-triggered offensive surge that temporarily boosts attack tempo and both attack- and spell-based output. Strategically he contributes persistent poke and siege, reliable zone control and anti-heal, and potent single-target pick or execute threat that synergizes with team setup and follow-up."}
{"name": "Vayne", "rationale": "Vayne reads as a Skirmisher: an isolated-duel focused marksman whose toolkit is built for high-mobility harassment, single-target execution, and outplay-based exchanges rather than raw teamfight control. Mechanically she centers on short, precise repositioning windows that empower her next attack and enable constant kiting and target resets, combined with a stacking true-damage mechanic that rewards sustained focus on one enemy and turns her into a specialist at shredding high-health foes. Her displacement that punishes terrain contact adds a skill-expressive form of hard crowd control and positional denial, while a timed powered-up mode amplifies damage and evasive tools to convert picks into kills. Strategically she supplies reliable single-target threat and split-pressure: an assassin-like duelist who forces opponents to respect isolation and terrain, creates high outplay potential through skillful spacing and timing, and naturally fills the role of frontline killer and flanker rather than area control or primary engage."}
{"name": "Veigar", "rationale": "Veigar is an Artillery Mage: a long-range, high-burst control caster who zones and punishes mispositioning. Mechanically he centers on stacking a permanent ability-power passive through ability hits and takedown interactions, turning routine spellcasting into progressive power growth; his toolkit emphasizes delayed area-impact and pinpoint single-target burst tied together by a cage-style crowd control that forces or punishes movement. Strategically he provides reliable pick threat and late-game one-shot potential, layered zone control for sieges and teamfights, and consistent wave pressure from repeatable nukes; he excels at setting up combos with allies, denying space, and converting small skirmishes or mistakes into decisive takedowns as the match progresses."}
{"name": "Vel'Koz", "rationale": "An Artillery Mage defined by extreme reach, predictive skillshot zoning and a sustained channel—he embodies long-range damage and analysis rather than frontline presence. Mechanically he layers a stacking true-damage proc through a persistent deconstruction counter, demands precise aiming with split-able projectiles and directional rifts, and offers a controllable, stoppable beam for extended punishment; he trades mobility for deliberate positioning and uses a short-duration displacement to set up combos and punish missteps. Strategically he provides siege and poke pressure, objective denial, reliable long-range waveclear, area denial and a precision execution tool that converts sustained harassment into guaranteed burst for teammates to capitalize on."}
{"name": "Vex", "rationale": "Artillery Mage — Vex is built as a long-range control mage that shapes fights from the backline rather than extended melee skirmishes. Mechanically she revolves around a mobility‑punishing mark and a shadow proxy that scales with cast distance: she rewards long‑range placement and mark consumption for burst and cooldown recovery while retaining a single‑target dash as a follow‑through option. Her kit blends ranged poke, distance‑scaling AoE, a defensive self‑shield, and a short fear to gate enemy approaches. Strategically she supplies reliable poke and wave control, zone denial and area slows for teamfights, vision/targeting on mobile threats, and a safe peel/short‑range engage tool to secure picks or punish dives."}
{"name": "Vi", "rationale": "Vi embodies the Diver archetype—a front-to-back engager who commits to single targets and forces cluttered fights into decisive skirmishes. Mechanically she centers on a chargeable gap‑closer that crescendos in range and impact, on‑hit stacking that converts to an execute-like interaction with built‑in armor reduction, and a fight‑sustaining shield mechanic that primes on her next offensive action and refreshes through extended trading; her empowered basic attack grants extended reach and cone damage for wave pressure and clustered threats, while a targeted displacement provides guaranteed lockdown on high‑value foes. Strategically she functions as a primary pick and initiation engine that shreds tanky frontlines, creates windows for follow‑up, pressures side lanes with opportunistic waveclear, and thrives in extended duels where shields and stack management determine outcomes."}
{"name": "Viego", "rationale": "Viego is a Skirmisher because he excels at isolated, extended duels and thrives by converting kills into continued fighting power and mobility rather than pure burst assassination. His kit orbits a possession mechanic that fundamentally transforms engagements: securing a takedown temporarily lets him appropriate an enemy’s kit and recover survivability, creating high-value resets and chaotic tradeoffs. Mechanically he blends on‑hit sustain and percent‑based finishing damage with targeted reposition tools, a chargeable single‑target lockdown, and a movement path that rewards restraint with speed and camouflage—plus an AoE displacement for disruption. Strategically he provides single‑target takeover, fight resets and cleanups, sustained skirmish pressure, flank and split‑push threat, and objective security by turning kills into renewed offensive windows for his team."}
{"name": "Viktor", "rationale": "Viktor is an Artillery Mage: a long-range, spell-focused caster who prioritizes durable poke and area denial over mobility. Mechanically he centers on a persistent augment progression—collecting upgrades that permanently enhance his spells and eventually empower his singularity tool—while combining empowered basic attacks and a short self-shield to shore up his fragility. His kit emphasizes sustained directional damage, persistent zone control, delayed hard crowd-control that punishes prolonged presence, and targeted interruption, so he excels at shaping space in fights, sieging and denying objectives, forcing enemy repositioning, and scaling into a teamfight-defining control and damage source as his augments arrive."}
{"name": "Vladimir", "rationale": "Battlemage — Vladimir functions as a sustained, scaling mage who converts between health and ability power to make defensive and offensive stats mutually reinforcing, fitting the Battlemage profile of extended skirmish dominance rather than short burst. Mechanically he revolves around an exchange economy: he spends and recovers health as a resource, builds and consumes short-term charge stacks to amplify spells, and relies on an untargetable mobility window for repositioning and safety. Strategically he brings reliable lane sustain and prolonged teamfight presence, area damage and crowd control that control space, a damage-amplifying debuff to increase team burst follow-up, and resilient front-to-back skirmishing that pressures objectives and punishes isolated targets."}
{"name": "Volibear", "rationale": "Diver — Volibear is a short‑range engager who commits to diving into enemy lines to disrupt and finish targets, fitting the Diver class through his leap‑centric initiation and turret‑threatening impact. Mechanically he is a momentum‑driven melee brawler that builds stacked attack momentum to convert sustained fighting into explosive on‑hit AoE, pairs a ghosted approach and an empowered leap for forced engages, and rewards single‑target stickiness with a wound/execute interaction that heals and scales with his durability; he also trades enemy maximum health for defensive shielding and applies area slows. Strategically he provides reliable hard initiation, close‑quarters disruption and sustained dueling presence, self‑sustain that lets him hold frontline space, target execution for pick threats, and objective pressure by threatening and temporarily neutralizing defensive structures."}
{"name": "Warwick", "rationale": "Warwick reads as a Diver: a single-target engager who closes on priority foes and anchors extended skirmishes. Mechanically he is built around health-threshold synergies and sustained on-hit conversion to self-heal, paired with a hunt mechanic that dramatically increases his chase and attack tempo against wounded targets. His toolkit blends a targeted gap-closer that suppresses and channels relentless damage with a defensive toggle that grants damage mitigation and a short-area crowd-control follow-up, enabling both stickiness and brief peel. Strategically he provides reliable pick and lockdown against carries, exceptional one-on-one dueling and sustain in prolonged fights, and objective pressure by forcing opponents to respect health and positioning thresholds."}
{"name": "Wukong", "rationale": "Wukong reads as a Diver: a mobile frontline skirmisher built to engage, stick to priority targets, and disrupt backlines. Mechanically he fuses gap-closing committal tools with deception and an empowered-basic attack, augmented by a defensive stacking passive that turns short trades into durable, repeatable duels; his kit spawns untargetable duplicates and grants brief concealment and repositioning to confuse targets, and his area-spin ultimate supplies sustained AoE damage with displacement to control space. Strategically he offers reliable flank and dive pressure, burst-to-sustain skirmishing, and teamfight disruption—rewarding timed engages, deceptive entries, and extended fights where durability stacks and area control determine the exchange."}
{"name": "Xayah", "rationale": "Marksman — Xayah is a ranged sustained DPS who defines herself through persistent projectile placement and retrieval rather than pure single-shot burst. Her mechanical identity centers on seeding spatially persistent feathers that augment basic attacks, creating layered on-hit damage and then calling those projectiles back to produce area damage and conditional crowd control; she also has a self-buff window that temporarily doubles attack output and grants mobility on champion hits, plus an untargetable repositioning burst that sprays directional projectiles. Strategically she offers reliable sustained damage combined with geometry-driven zone control and pick potential: she shapes fights by forcing opponents out of seeded areas, punishes poor spacing with mass-return roots, provides strong poke and waveclear, and pairs exceptionally well with an aggressive, mobile support for coordinated engages and skirmishes."}
{"name": "Xerath", "rationale": "Xerath is an Artillery Mage: a stationary extreme-range caster whose identity centers on long-distance harassment and zone control. Mechanically he relies on chargeable, travel-dependent skillshots and a channeled multi-missile ultimate that grows stronger as he lands hits on enemy champions, while sustaining his arcane energy through on-hit restorations and takedown-linked renewal. Strategically he enforces space and objective pressure from safety, offering reliable poke, delayed AoE disruption with heightened center impact, and travel-distance-scaled crowd control for picks; his strengths demand disciplined positioning and timing, trading mobility for unparalleled ranged threat and siege presence."}
{"name": "Xin Zhao", "rationale": "Xin Zhao fits the Skirmisher archetype: a melee duelist built to pick a single opponent, close the gap, and win brief, committed fights. His mechanical identity orbits empowered basic-attack sequences that convert sustained trading into burst and self-sustain, combined with an empowered-hit chain that enforces commitment and refreshes his combat uptime. He couples a targeted gap-close and small-area disruption with an attack-speed/onslaught steroid to reliably stick to and pressure targets. Strategically he delivers dependable single-target lockdown and sustained 1v1 threat, punishes isolated enemies, creates close-range denial against ranged foes, and anchors melees as an initiator and skirmish finisher."}
{"name": "Yasuo", "rationale": "Skirmisher — a mobile, close-range duelist that excels in layered trades and extended fights through repeated repositioning and high-risk outplay potential. Mechanically he revolves around stacking internal resources that both grant a defensive shield and improve his crit efficiency while building offensive charges from successive thrusts and dashes; those charges convert into a reliable airborne disruption that he can capitalize on to reposition and chain follow-up damage. His toolkit emphasizes on‑hit interactions, short-range mobility through enemy targets, and a directional projectile barrier that creates reactive defensive windows. Strategically he supplies dependable single-target pick and skirmish initiation, vertical CC that enables team follow-ups, strong 1v1 and split-pressure, and a projectile-denial plane that can blunt poke and enable decisive re-engagements once his stacks are established."}
{"name": "Yone", "rationale": "Yone reads as a Skirmisher—an agile duelist built to win extended fights and create flank or pick windows—because his kit centers on single-target threat, layered mobility, and self-sustain rather than pure burst or frontline tanking. Mechanically he is a dual‑blade hybrid attacker: basic attacks alternate between two swords dealing both physical and magic damage while trading higher critical chance for reduced crit multiplier; he stacks on-hit hits into a powered dash, has a cone that deals damage proportional to target maximum health and grants a short shield, can separate into a spirit form that reactivates to reunite and deal true damage to marked foes, and wields an area charge that stuns, teleports him behind distant targets and pulls them. Strategically he supplies sustained single-target dueling, flank and gap‑closing pressure that can bypass frontlines, built‑in survivability for extended trades, and reliable lockdown/repositioning for picks and teamfight initiation."}
{"name": "Yorick", "rationale": "Fighter (split-pusher / juggernaut) — Yorick functions as a durable, lane‑centric melee champion who prizes sustained trades and local superiority. Mechanically he builds persistent battlefield presence by converting dead foes into controllable summons and by summoning a single, autonomous powerhouse that generates additional minions; he pairs that with an empowered basic attack that provides ranged reach and self‑sustain, a targeted displacement that creates temporary terrain for zoning and isolation, and a marking/impeding effect that amplifies follow‑up on marked targets. Strategically he pressures side‑lanes and objectives through summoned forces, creates oppressive local numbers to win extended skirmishes, shapes fights by denying movement and isolating carries, and forces opponents to respond to his anchored, objective‑oriented split‑push threat."}
{"name": "Yuumi", "rationale": "An Enchanter support that functions as a tethered utility conduit rather than an independent frontline presence. Mechanically she revolves around attaching to allies to become untargetable and to project her kit from their position, accumulating affinity with teammates that changes where her benefits are strongest. Her toolkit emphasizes remote sustain, shields, movement and attack-speed assistance, and guided poke and zoning that scale in potency while bonded; excess healing converts to protection, and resource restoration further empowers allies. Strategically she supplies consistent single-target sustain and peel, layered protection for a carry, empowered poke and zone control from safety, and high flexibility in where team benefits are concentrated at any moment."}
{"name": "Zac", "rationale": "Zac is a Diver: his design centers on high-commitment, long-range initiation and sustained in-combat mobility that allows him to plunge into enemy formations and disrupt backlines. Mechanically he converts his own durability into a playmaking resource—damaging actions spawn contested pickups that restore health and refresh uptime—paired with a charge-and-launch entry that can be recast, a tethered follow-up that extends trades, and a multi-impact aerial sequence that displaces and slows foes; a built-in failstate revival grants him unusual tolerance for all-in plays. Strategically he supplies reliable frontline engage, layered crowd control and zone disruption, sustained dive threat and objective pressure, and the ability to force mispositioning and bait enemy cooldowns."}
{"name": "Zed", "rationale": "Assassin — Zed is a mobile, high-burst skirmisher who embodies clean single-target execution and shadow-based deception; he fits the Assassin class because his kit is built to isolate and rapidly eliminate priority targets through timed windows of vulnerability. Mechanically he operates by creating controllable shadow duplicates that mirror selected attacks, enabling asynchronous multi-source pressure, extended reach, and shadow-swapping for repositioning; he pairs that with a built-in amplified-damage mechanic that punishes already-weakened foes (with an internal gating to prevent repetition) and a mark that converts damage dealt during its duration into concentrated burst. Strategically he offers lethal pick potential, fan-out pressure via duplicated zoning and poke, strong short-trade and outplay opportunities through shadow mobility and a brief untargetable engage, and a constant threat that forces opponents to respect his assassination timing and positioning in skirmishes and split engagements."}
{"name": "Zeri", "rationale": "Zeri is a Marksman with strong skirmisher tendencies: she functions as a mobile, duelist-focused ranged carry who leverages movement and terrain to reforge engagements. Mechanically she alternates between two attack identities—movement‑charged basic shots that act as spell damage and a separate burst volley that behaves like a conventional crit/on‑hit‑capable attack—while her toolkit rewards weaving movement, ability casts and charged attacks to refresh mobility windows and sustain an empowered state. Strategically Zeri supplies mobile sustained DPS, excellent kiting and extended trades, plus terrain-driven assassination and zone control; she excels at hit‑and‑run skirmishes, dynamic repositioning for single‑target pressure, and maintaining prolonged output in extended fights."}
{"name": "Ziggs", "rationale": "Ziggs is an Artillery Mage: a long-range, indirect damage specialist built around explosive zone control and siege. Mechanically he functions by layering area-of-effect explosives and persistent pressure—his kit rewards weaving ability use and empowered basic attacks to maintain steady poke and enhanced structure damage while sacrificing frontline stickiness for stand-off safety. He creates constrained fight geometry with mines and area bursts that punish approach, offers a targeted displacement tool for repositioning or peeling, and carries a large, high-impact finisher that compels opponents to avoid a precise ground point. Strategically, Ziggs supplies reliable poke and waveclear, objective and turret siege pressure, area denial for flank control, and a safe, tempo-oriented way to force fights and secure objectives."}
{"name": "Zilean", "rationale": "Zilean is an Enchanter utility mage defined by temporal manipulation rather than raw burst or frontline durability. Mechanically he centers on resource and cooldown control: he stockpiles and reallocates progression to accelerate allies, resets his own spell rhythm, and uses attachable area explosives plus movement-altering effects to punish mispositioning and shape space. This kit sacrifices personal tankiness and sustained damage for high-value timing plays and tempo denial—providing zoning, reveal, and peel through bombs and slows while enabling clutch outs via a single-target temporal resurrection. Strategically he supplies tempo control and power-spike acceleration, turning moments of overextension into picks, enabling aggressive tempo plays, and reliably protecting key carries."}
{"name": "Zoe", "rationale": "Zoe is an Artillery Mage: a long-range, skillshot-focused burst caster whose identity is centered on delivering high single-target and poke damage from distance rather than extended trades. Mechanically she functions as a combo-dependent skirmisher that builds advantage through precise setup and timing—her kit rewards chaining an empowered follow-up attack, travel-distance scaling projectiles, and brief stolen/external-ability utility with a short reposition that automatically returns her to safety. Success depends on landing disruptive crowd-control or difficult skillshots to create high-damage opportunities and on exploiting temporary extra bolts/utility. Strategically she supplies pick potential, long-range siege and zone control, roaming pressure through sudden utility spikes, and high outplay expression at the cost of low frontline durability and limited sustained teamfight presence."}
{"name": "Zyra", "rationale": "Zyra reads as an Artillery Mage who shapes fights from a distance by seeding the battlefield and forcing opponents to navigate around persistent hazards; her identity is rooted in long-range zone control rather than sustained melee trading. Mechanically she operates around deployable seed objects and a stored-plant currency that she places and then activates with her spells to spawn short-lived autonomous plants that extend her cast volume, layering poke, incidental vision, and intermittent damage; seeds are interactive (can be destroyed by enemy movement and briefly reveal their destroyer), and many of her spells gain additional utility when they intersect with seeds. Strategically she provides sustained area denial, layered poke and objective control, flank-threat pressure through summonable minions, and multi-target crowd control that converts single-target engages into teamfight advantages, favoring map shaping and zoning over straightforward dueling."}
